// import 'package:flutter/material.dart';

const Map hizbsMap = {
  1: {
    'number': 1,
    'short': "اِ۬لْحَمْدُ لِلهِ رَبِّ اِ۬لْعَٰالَمِينَ",
    'long':
        "اِ۬لْحَمْدُ لِلهِ رَبِّ اِ۬لْعَالَمِينَ اَ۬لرَّحْمَٰانِ اِ۬لرَّحِيمِ مَلِكِ يَوْمِ اِ۬لدِّينِۖ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُۖ اُ۪هْدِنَا اَ۬لصِّرَاطَ اَ۬لْمُسْتَقِيمَ صِرَاطَ اَ۬لذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ اِ۬لْمَغْضُوبِ عَلَيْهِمْ وَلَا اَ۬لضَّآلِّينَۖ",
    'surat': 'الفاتحة'
  },
  2: {
    'number': 2,
    'short': "وَإِذَا لَقُواْ اُ۬لذِينَ ءَامَنُواْ",
    'long':
        "وَإِذَا لَقُواْ اُ۬لذِينَ ءَامَنُواْ قَالُواْ ءَامَنَّاۖ وَإِذَا خَلَا بَعْضُهُمُۥٓ إِلَى بَعْضٖ قَالُواْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ اَ۬للَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمُۥٓۖ أَفَلَا تَعْقِلُونَۖ أَوَلَا يَعْلَمُونَ أَنَّ اَ۬للَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَۖ",
    'surat': 'البقرة'
  },
  3: {
    'number': 3,
    'short': "سَيَقُولُ اُ۬لسُّفَهَآءُ مِنَ اَ۬لنَّاسِ",
    'long':
        "سَيَقُولُ اُ۬لسُّفَهَآءُ مِنَ اَ۬لنَّاسِ مَا وَلّيٰهُمْ عَن قِبْلَتِهِمُ اُ۬لتِے كَانُواْ عَلَيْهَاۖ قُل لِّلهِ اِ۬لْمَشْرِقُ وَالْمَغْرِبُۖ يَهْدِے مَنْ يَّشَآءُ اِ۪لَيٰ صِرَٰطٖ مُّسْتَقِيمٖۖ وَكَذَٰلِكَ جَعَلْنَٰكُمُۥٓ أُمَّةً وَسَطاٗ لِّتَكُونُواْ شُهَدَآءَ عَلَى اَ۬لنَّاسِ وَيَكُونَ اَ۬لرَّسُولُ عَلَيْكُمْ شَهِيداٗۖ",
    'surat': 'البقرة'
  },
  4: {
    'number': 4,
    'short': "وَاذْكُرُواْ اُ۬للَّهَ فِےٓ أَيَّامٖ مَّعْدُودَٰتٖۖ",
    'long':
        "وَاذْكُرُواْ اُ۬للَّهَ فِےٓ أَيَّامٖ مَّعْدُودَاتٖۖ فَمَن تَعَجَّلَ فِے يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ لِمَنِ اِ۪تَّق۪ى وَاتَّقُواْ اُ۬للَّهَ وَاعْلَمُوٓاْ أَنَّكُمُۥٓ إِلَيْهِ تُحْشَرُونَۖ وَمِنَ اَ۬لنَّاسِ مَنْ يُّعْجِبُكَ قَوْلُهُۥ فِے اِ۬لْحَيَوٰةِ اِ۬لدُّنْي۪ا وَيُشْهِدُ اُ۬للَّهَ عَلَيٰ مَا فِے قَلْبِهِۦ وَهُوَ أَلَدُّ اُ۬لْخِصَامِۖ",
    'surat': 'البقرة'
  },
  5: {
    'number': 5,
    'short': "تِلْكَ اَ۬لرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَيٰ بَعْضٖۖ",
    'long':
        "تِلْكَ اَ۬لرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٖۖ مِّنْهُم مَّن كَلَّمَ اَ۬للَّهُۖ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٖۖ وَءَاتَيْنَا عِيسَي اَ۪بْنَ مَرْيَمَ اَ۬لْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ اِ۬لْقُدُسِۖ وَلَوْ شَآءَ اَ۬للَّهُ مَا اَ۪قْتَتَلَ اَ۬لذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ اُ۬لْبَيِّنَٰتُ",
    'surat': 'البقرة'
  },
  6: {
    'number': 6,
    'short': "قُلَ اَوْ۟نَبِّئُكُم بِخَيْرٖ مِّن ذَٰلِكُمْۖ",
    'long':
        "قُلَ اَوْ۟نَبِّئُكُم بِخَيْرٖ مِّن ذَٰلِكُمْۖ لِلذِينَ اَ۪تَّقَوْاْ عِندَ رَبِّهِمْ جَنَّٰاتٌ تَجْرِے مِن تَحْتِهَا اَ۬لَانْهَٰرُ خَٰلِدِينَ فِيهَا وَأَزْوَٰجٌ مُّطَهَّرَةٌ وَرِضْوَٰنٌ مِّنَ اَ۬للَّهِۖ وَاللَّهُ بَصِيرُۢ بِالْعِبَادِۖ اِ۬لذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ اَ۬لنّ۪ارِۖ",
    'surat': 'آل عمران'
  },
  7: {
    'number': 7,
    'short': "لَن تَنَالُواْ اُ۬لْبِرَّ حَتَّيٰ تُنفِقُواْ مِمَّا تُحِبُّونَۖ",
    'long':
        "لَن تَنَالُواْ اُ۬لْبِرَّ حَتَّيٰ تُنفِقُواْ مِمَّا تُحِبُّونَۖ وَمَا تُنفِقُواْ مِن شَےْءٖ فَإِنَّ اَ۬للَّهَ بِهِۦ عَلِيمٌ كُلُّ اُ۬لطَّعَامِ كَانَ حِلّاٗ لِّبَنِےٓ إِسْرَآءِيلَ إِلَّا مَا حَرَّمَ إِسْرَآءِيلُ عَلَيٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ اَ۬لتَّوْر۪يٰةُۖ ",
    'surat': 'آل عمران'
  },
  8: {
    'number': 8,
    'short': "يَسْتَبْشِرُونَ بِنِعْمَةٖ مِّنَ اَ۬للَّهِ وَفَضْلٖ",
    'long':
        "يَسْتَبْشِرُونَ بِنِعْمَةٍ مِّنَ اَ۬للَّهِ وَفَضْلٍ وَأَنَّ اَ۬للَّهَ لَا يُضِيعُ أَجْرَ اَ۬لْمُومِنِينَ اَ۬لذِينَ اَ۪سْتَجَابُواْ لِلهِ وَالرَّسُولِ مِنْ بَعْدِ مَآ أَصَابَهُمُ اُ۬لْقَرْحُۖ لِلذِينَ أَحْسَنُواْ مِنْهُمْ وَاتَّقَوَاْ اَجْرٌ عَظِيمٌۖ اِ۬لذِينَ قَالَ لَهُمُ اُ۬لنَّاسُ إِنَّ اَ۬لنَّاسَ قَدْ جَمَعُواْ لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمُۥٓ إِيمَٰناٗۖ وَقَالُواْ حَسْبُنَا اَ۬للَّهُ وَنِعْمَ اَ۬لْوَكِيلُۖ",
    'surat': 'آل عمران'
  },
  9: {
    'number': 9,
    'short':
        "وَالْمُحْصَنَٰتُ مِنَ اَ۬لنِّسَآءِ الَّا مَا مَلَكَتَ اَيْمَٰنُكُمْۖ",
    'long':
        "وَالْمُحْصَنَٰتُ مِنَ اَ۬لنِّسَآءِ الَّا مَا مَلَكَتَ اَيْمَٰنُكُمْۖ كِتَٰبَ اَ۬للَّهِ عَلَيْكُمْۖ وَأَحَلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمُۥٓ أَن تَبْتَغُواْ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَٰفِحِينَۖ فَمَا اَ۪سْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةٗۖ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ اِ۬لْفَرِيضَةِۖ إِنَّ اَ۬للَّهَ كَانَ عَلِيماً حَكِيماٗۖ",
    'surat': 'النساء'
  },
  10: {
    'number': 10,
    'short': "اِ۬للَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ",
    'long':
        "اِ۬للَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ لَيَجْمَعَنَّكُمُۥٓ إِلَى يَوْمِ اِ۬لْقِيَٰمَةِ لَا رَيْبَ فِيهِۖ وَمَنَ اَصْدَقُ مِنَ اَ۬للَّهِ حَدِيثاٗۖ فَمَا لَكُمْ فِے اِ۬لْمُنَٰفِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُم بِمَا كَسَبُوٓاْۖ أَتُرِيدُونَ أَن تَهْدُواْ مَنَ اَضَلَّ اَ۬للَّهُۖ وَمَنْ يُّضْلِلِ اِ۬للَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلاٗۖ",
    'surat': 'النساء'
  },
  11: {
    'number': 11,
    'short':
        "لَّا يُحِبُّ اُ۬للَّهُ اُ۬لْجَهْرَ بِالسُّوٓءِ مِنَ اَ۬لْقَوْلِ إِلَّا مَن ظُلِمَۖ",
    'long':
        "لَّا يُحِبُّ اُ۬للَّهُ اُ۬لْجَهْرَ بِالسُّوٓءِ مِنَ اَ۬لْقَوْلِ إِلَّا مَن ظُلِمَۖ وَكَانَ اَ۬للَّهُ سَمِيعاً عَلِيماًۖ اِن تُبْدُواْ خَيْراً اَوْ تُخْفُوهُ أَوْ تَعْفُواْ عَن سُوٓءٖ فَإِنَّ اَ۬للَّهَ كَانَ عَفُوّاٗ قَدِيراًۖ",
    'surat': 'النساء'
  },
  12: {
    'number': 12,
    'short':
        "قَالَ رَجُلَانِ مِنَ اَ۬لذِينَ يَخَافُونَ أَنْعَمَ اَ۬للَّهُ عَلَيْهِمَا",
    'long':
        "قَالَ رَجُلَانِ مِنَ اَ۬لذِينَ يَخَافُونَ أَنْعَمَ اَ۬للَّهُ عَلَيْهِمَا اَ۟دْخُلُواْ عَلَيْهِمُ اُ۬لْبَابَۖ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَٰلِبُونَۖ وَعَلَى اَ۬للَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّومِنِينَۖ قَالُواْ يَٰمُوس۪يٰٓ إِنَّا لَن نَّدْخُلَهَآ أَبَداٗ مَّا دَامُواْ فِيهَا فَاذْهَبَ اَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰاعِدُونَۖ",
    'surat': 'المائدة'
  },
  13: {
    'number': 13,
    'short':
        "لَتَجِدَنَّ أَشَدَّ اَ۬لنَّاسِ عَدَٰوَةٗ لِّلذِينَ ءَامَنُواْ اُ۬لْيَهُودَ",
    'long':
        "لَتَجِدَنَّ أَشَدَّ اَ۬لنَّاسِ عَدَٰاوَةٗ لِّلذِينَ ءَامَنُواْ اُ۬لْيَهُودَ وَالذِينَ أَشْرَكُواْۖ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةٗ لِّلذِينَ ءَامَنُواْ اُ۬لذِينَ قَالُوٓاْ إِنَّا نَصَٰر۪ى ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَاناٗ وَأَنَّهُمْ لَا يَسْتَكْبِرُونَۖ ",
    'surat': 'المائدة'
  },
  14: {
    'number': 14,
    'short': "إِنَّمَا يَسْتَجِيبُ اُ۬لذِينَ يَسْمَعُونَۖ",
    'long':
        "إِنَّمَا يَسْتَجِيبُ اُ۬لذِينَ يَسْمَعُونَۖ وَالْمَوْت۪ى يَبْعَثُهُمُ اُ۬للَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَۖ وَقَالُواْ لَوْلَا نُزِّلَ عَلَيْهِ ءَايَةٞ مِّن رَّبِّهِۦۖ قُلِ اِنَّ اَ۬للَّهَ قَادِرٌ عَلَى أَنْ يُّنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَۖ",
    'surat': 'الأنعام'
  },
  15: {
    'number': 15,
    'short': "وَلَوَ اَنَّنَا نَزَّلْنَآ إِلَيْهِمُ اُ۬لْمَلَٰٓائِكَةَ",
    'long':
        "وَلَوَ اَنَّنَا نَزَّلْنَآ إِلَيْهِمُ اُ۬لْمَلَٰٓائِكَةَ وَكَلَّمَهُمُ اُ۬لْمَوْت۪ى وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَےْءٖ قِبَلاٗ مَّا كَانُواْ لِيُومِنُوٓاْ إِلَّآ أَنْ يَّشَآءَ اَ۬للَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَۖ",
    'surat': 'الأنعام'
  },
  16: {
    'number': 16,
    'short': "فَمَا كَانَ دَعْو۪يٰهُمُۥٓ إِذْ جَآءَهُم بَأْسُنَآ",
    'long':
        "فَمَا كَانَ دَعْو۪يٰهُمُۥٓ إِذْ جَآءَهُم بَأْسُنَآ إِلَّآ أَن قَالُوٓاْ إِنَّا كُنَّا ظَٰلِمِينَۖ فَلَنَسْـَٔلَنَّ اَ۬لذِينَ أُرْسِلَ إِلَيْهِمْ وَلَنَسْـَٔلَنَّ اَ۬لْمُرْسَلِينَۖ فَلَنَقُصَّنَّ عَلَيْهِم بِعِلْمٖۖ وَمَا كُنَّا غَآئِبِينَۖ وَالْوَزْنُ يَوْمَئِذٍ اِ۬لْحَقُّۖ فَمَن ثَقُلَتْ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ اُ۬لْمُفْلِحُونَۖ",
    'surat': 'الأعراف'
  },
  17: {
    'number': 17,
    'short': "قَالَ اَ۬لْمَلَأُ اُ۬لذِينَ اَ۪سْتَكْبَرُواْ",
    'long':
        "قَالَ اَ۬لْمَلَأُ اُ۬لذِينَ اَ۪سْتَكْبَرُواْ مِن قَوْمِهِۦ لَنُخْرِجَنَّكَ يَٰاشُعَيْبُ وَالذِينَ ءَامَنُواْ مَعَكَ مِن قَرْيَتِنَآ أَوْ لَتَعُودُنَّ فِے مِلَّتِنَاۖ قَالَ أَوَلَوْ كُنَّا كَٰارِهِينَۖ قَدِ اِ۪فْتَرَيْنَا عَلَى اَ۬للَّهِ كَذِباً اِنْ عُدْنَا فِے مِلَّتِكُم بَعْدَ إِذْ نَجّ۪يٰنَا اَ۬للَّهُ مِنْهَاۖ وَمَا يَكُونُ لَنَآ أَن نَّعُودَ فِيهَآ إِلَّآ أَنْ يَّشَآءَ اَ۬للَّهُ رَبُّنَاۖ وَسِعَ رَبُّنَا كُلَّ شَےْءٍ عِلْماًۖ عَلَى اَ۬للَّهِ تَوَكَّلْنَاۖ",
    'surat': 'الأعراف'
  },
  18: {
    'number': 18,
    'short': "وَإِذْ نَتَقْنَا اَ۬لْجَبَلَ فَوْقَهُمْ",
    'long':
        "وَإِذْ نَتَقْنَا اَ۬لْجَبَلَ فَوْقَهُمْ كَأَنَّهُۥ ظُلَّةٞ وَظَنُّوٓاْ أَنَّهُۥ وَاقِعُۢ بِهِمْ خُذُواْ مَآ ءَاتَيْنَٰكُم بِقُوَّةٖ وَاذْكُرُواْ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَۖ وَإِذَ اَخَذَ رَبُّكَ مِنۢ بَنِےٓ ءَادَمَ مِن ظُهُورِهِمْ ذُرِّيَّٰتِهِمْ وَأَشْهَدَهُمْ عَلَيٰٓ أَنفُسِهِمُۥٓ أَلَسْتُ بِرَبِّكُمْ قَالُواْ بَل۪ى شَهِدْنَآ",
    'surat': 'الأعراف'
  },
  19: {
    'number': 19,
    'short': "وَاعْلَمُوٓاْ أَنَّمَا غَنِمْتُم",
    'long':
        "وَاعْلَمُوٓاْ أَنَّمَا غَنِمْتُم مِّن شَےْءٖ فَأَنَّ لِلهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِے اِ۬لْقُرْب۪يٰ وَالْيَتَٰام۪ى وَالْمَسَٰاكِينِ وَابْنِ اِ۬لسَّبِيلِ إِن كُنتُمُۥٓ ءَامَنتُم بِاللَّهِ وَمَآ أَنزَلْنَا عَلَى عَبْدِنَا يَوْمَ اَ۬لْفُرْقَانِ يَوْمَ اَ۪لْتَقَى اَ۬لْجَمْعَٰنِۖ وَاللَّهُ عَلَيٰ كُلِّ شَےْءٖ قَدِيرٌۖ ",
    'surat': 'الأنفال'
  },
  20: {
    'number': 20,
    'short':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُوٓاْ إِنَّ كَثِيراً مِّنَ اَ۬لَاحْب۪ارِ",
    'long':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُوٓاْ إِنَّ كَثِيراً مِّنَ اَ۬لَاحْب۪ارِ وَالرُّهْبَانِ لَيَاكُلُونَ أَمْوَٰلَ اَ۬لنَّاسِ بِالْبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ اِ۬للَّهِۖ وَالذِينَ يَكْنِزُونَ اَ۬لذَّهَبَ وَالْفِضَّةَ وَلَا يُنفِقُونَهَا فِے سَبِيلِ اِ۬للَّهِ فَبَشِّرْهُم بِعَذَابٍ اَلِيمٖۖ يَوْمَ يُحْم۪يٰ عَلَيْهَا فِے ن۪ارِ جَهَنَّمَ فَتُكْو۪يٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ هَٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُواْ مَا كُنتُمْ تَكْنِزُونَۖ",
    'surat': 'التوبة'
  },
  21: {
    'number': 21,
    'short':
        "إِنَّمَا اَ۬لسَّبِيلُ عَلَى اَ۬لذِينَ يَسْتَٰذِنُونَكَ وَهُمُۥٓ أَغْنِيَآءُۖ ",
    'long':
        "إِنَّمَا اَ۬لسَّبِيلُ عَلَى اَ۬لذِينَ يَسْتَٰذِنُونَكَ وَهُمُۥٓ أَغْنِيَآءُۖ رَضُواْ بِأَنْ يَّكُونُواْ مَعَ اَ۬لْخَوَالِفِۖ وَطَبَعَ اَ۬للَّهُ عَلَيٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَۖ يَعْتَذِرُونَ إِلَيْكُمُۥٓ إِذَا رَجَعْتُمُۥٓ إِلَيْهِمْۖ قُل لَّا تَعْتَذِرُواْ لَن نُّومِنَ لَكُمْۖ قَدْ نَبَّأَنَا اَ۬للَّهُ مِنَ اَخْب۪ارِكُمْۖ",
    'surat': 'التوبة'
  },
  22: {
    'number': 22,
    'short': "لِّلذِينَ أَحْسَنُواْ اُ۬لْحُسْن۪ى وَزِيَادَةٞۖ",
    'long':
        "لِّلذِينَ أَحْسَنُواْ اُ۬لْحُسْن۪ى وَزِيَادَةٞۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٞ وَلَا ذِلَّةٌۖ ا۟وْلَٰٓئِكَ أَصْحَٰبُ اُ۬لْجَنَّةِۖ هُمْ فِيهَا خَٰلِدُونَۖ وَالذِينَ كَسَبُواْ اُ۬لسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةِۢ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٞ مَّا لَهُم مِّنَ اَ۬للَّهِ مِنْ عَاصِمٖ كَأَنَّمَآ أُغْشِيَتْ وُجُوهُهُمْ قِطَعاٗ مِّنَ اَ۬ليْلِ مُظْلِماًۖ",
    'surat': 'يونس'
  },
  23: {
    'number': 23,
    'short':
        "وَمَا مِن دَآبَّةٍ فِے اِ۬لَارْضِ إِلَّا عَلَى اَ۬للَّهِ رِزْقُهَا",
    'long':
        "وَمَا مِن دَآبَّةٍ فِے اِ۬لَارْضِ إِلَّا عَلَى اَ۬للَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَاۖ كُلّٞ فِے كِتَٰبٖ مُّبِينٖۖ وَهُوَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ فِے سِتَّةِ أَيَّامٍ وَكَانَ عَرْشُهُۥ عَلَى اَ۬لْمَآءِ لِيَبْلُوَكُمُۥٓ أَيُّكُمُۥٓ أَحْسَنُ عَمَلاٗۖ",
    'surat': 'هود'
  },
  24: {
    'number': 24,
    'short': "وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْباٗۖ",
    'long':
        "وَإِلَى مَدْيَنَ أَخَاهُمْ شُعَيْباٗۖ قَالَ يَٰقَوْمِ اِ۟عْبُدُواْ اُ۬للَّهَ مَا لَكُم مِّنِ اِلَٰهٍ غَيْرُهُۥۖ وَلَا تَنقُصُواْ اُ۬لْمِكْيَالَ وَالْمِيزَانَۖ إِنِّيَ أَر۪يٰكُم بِخَيْرٖ وَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٖ مُّحِيطٖۖ وَيَٰقَوْمِ أَوْفُواْ اُ۬لْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِۖ وَلَا تَبْخَسُواْ اُ۬لنَّاسَ أَشْيَآءَهُمْ وَلَا تَعْثَوْاْ فِے اِ۬لَارْضِ مُفْسِدِينَۖ",
    'surat': 'هود'
  },
  25: {
    'number': 25,
    'short': "وَمَآ أُبَرِّۓُ نَفْسِيَۖ",
    'long':
        "وَمَآ أُبَرِّۓُ نَفْسِيَۖ إِنَّ اَ۬لنَّفْسَ لَأَمَّارَةُۢ بِالسُّوٓءِ الَّا مَا رَحِمَ رَبِّيَۖ إِنَّ رَبِّے غَفُورٞ رَّحِيمٞۖ وَقَالَ اَ۬لْمَلِكُ اُ۪يتُونِے بِهِۦٓ أَسْتَخْلِصْهُ لِنَفْسِےۖ فَلَمَّا كَلَّمَهُۥ قَالَ إِنَّكَ اَ۬لْيَوْمَ لَدَيْنَا مَكِينٌ اَمِينٞۖ",
    'surat': 'يوسف'
  },
  26: {
    'number': 26,
    'short':
        "أَفَمَنْ يَّعْلَمُ أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ اَ۬لْحَقُّ",
    'long':
        "أَفَمَنْ يَّعْلَمُ أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ اَ۬لْحَقُّ كَمَنْ هُوَ أَعْم۪ىٰۖ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ اُ۬لَالْبَٰبِ (21) اِ۬لذِينَ يُوفُونَ بِعَهْدِ اِ۬للَّهِ وَلَا يَنقُضُونَ اَ۬لْمِيثَٰقَ (22) وَالذِينَ يَصِلُونَ مَآ أَمَرَ اَ۬للَّهُ بِهِۦٓ أَنْ يُّوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوٓءَ اَ۬لْحِسَابِ ",
    'surat': 'الرعد'
  },
  27: {
    'number': 27,
    'short': "أَلَٓر۪ۖ تِلْكَ ءَايَٰتُ اُ۬لْكِتَٰبِ وَقُرْءَانٍ مُّبِينٍۖ",
    'long':
        "أَلَٓر۪ۖ تِلْكَ ءَايَٰتُ اُ۬لْكِتَٰبِ وَقُرْءَانٍ مُّبِينٍۖ رُّبَمَا يَوَدُّ اُ۬لذِينَ كَفَرُواْ لَوْ كَانُواْ مُسْلِمِينَۖ ذَرْهُمْ يَاكُلُواْ وَيَتَمَتَّعُواْ وَيُلْهِهِمُ اُ۬لَامَلُ فَسَوْفَ يَعْلَمُونَۖ وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ اِلَّا وَلَهَا كِتَابٞ مَّعْلُومٞۖ مَّا تَسْبِقُ مِنُ ا۟مَّةٍ اَجَلَهَا وَمَا يَسْتَٰخِرُونَۖ",
    'surat': 'الحجر'
  },
  28: {
    'number': 28,
    'short': "وَقَالَ اَ۬للَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيْنِ اِ۪ثْنَيْنِۖ",
    'long':
        "وَقَالَ اَ۬للَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيْنِ اِ۪ثْنَيْنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞۖ فَإِيَّٰيَ فَارْهَبُونِۖ وَلَهُۥ مَا فِے اِ۬لسَّمَٰوَٰتِ وَالَارْضِ وَلَهُ اُ۬لدِّينُ وَاصِباًۖ اَفَغَيْرَ اَ۬للَّهِ تَتَّقُونَۖ وَمَا بِكُم مِّن نِّعْمَةٖ فَمِنَ اَ۬للَّهِۖ ثُمَّ إِذَا مَسَّكُمُ اُ۬لضُّرُّ فَإِلَيْهِ تَجْـَٔرُونَۖ ثُمَّ إِذَا كَشَفَ اَ۬لضُّرَّ عَنكُمُۥٓ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمْ يُشْرِكُونَ لِيَكْفُرُواْ بِمَآ ءَاتَيْنَٰهُمْۖ فَتَمَتَّعُواْۖ فَسَوْفَ تَعْلَمُونَۖ",
    'surat': 'النحل'
  },
  29: {
    'number': 29,
    'short': "سُبْحَٰنَ اَ۬لذِےٓ أَسْر۪ىٰ بِعَبْدِهِۦ لَيْلاٗ",
    'long':
        "سُبْحَٰنَ اَ۬لذِےٓ أَسْر۪ىٰ بِعَبْدِهِۦ لَيْلاٗ مِّنَ اَ۬لْمَسْجِدِ اِ۬لْحَرَامِ إِلَي اَ۬لْمَسْجِدِ اِ۬لَاقْصَا اَ۬لذِے بَٰرَكْنَا حَوْلَهُۥ لِنُرِيَهُۥ مِنَ اٰيَٰتِنَآۖ إِنَّهُۥ هُوَ اَ۬لسَّمِيعُ اُ۬لْبَصِيرُۖ وَءَاتَيْنَا مُوسَي اَ۬لْكِتَٰبَ وَجَعَلْنَٰهُ هُديٗ لِّبَنِےٓ إِسْرَآءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِے وَكِيلاٗ ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍۖ اِنَّهُۥ كَانَ عَبْداٗ شَكُوراٗۖ ",
    'surat': 'الإسراء'
  },
  30: {
    'number': 30,
    'short':
        "اَوَلَمْ يَرَوَاْ اَنَّ اَ۬للَّهَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ",
    'long':
        "اَوَلَمْ يَرَوَاْ اَنَّ اَ۬للَّهَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ قَادِرٌ عَلَيٰٓ أَنْ يَّخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمُۥٓ أَجَلاٗ لَّا رَيْبَ فِيهِ فَأَبَي اَ۬لظَّٰلِمُونَ إِلَّا كُفُوراٗۖ قُل لَّوَ اَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّيَ إِذاٗ لَّأَمْسَكْتُمْ خَشْيَةَ اَ۬لِانفَاقِۖ وَكَانَ اَ۬لِانسَٰنُ قَتُوراٗۖ",
    'surat': 'الإسراء'
  },
  31: {
    'number': 31,
    'short': "قَالَ أَلَمَ اَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِے صَبْراٗۖ",
    'long':
        "قَالَ أَلَمَ اَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِے صَبْراٗۖ قَالَ إِن سَأَلْتُكَ عَن شَےْءِۢ بَعْدَهَا فَلَا تُصَٰحِبْنِے قَدْ بَلَغْتَ مِن لَّدُنِے عُذْراٗۖ فَانطَلَقَا حَتَّيٰٓ إِذَآ أَتَيَآ أَهْلَ قَرْيَةٍ اِ۪سْتَطْعَمَآ أَهْلَهَا فَأَبَوَاْ اَنْ يُّضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَاراٗ يُرِيدُ أَنْ يَّنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوْ شِئْتَ لَتَّخَذتَّ عَلَيْهِ أَجْراٗۖ قَالَ هَٰذَا فِرَاقُ بَيْنِے وَبَيْنِكَۖ",
    'surat': 'الكهف'
  },
  32: {
    'number': 32,
    'short': "طَه۪ۖ مَآ أَنزَلْنَا عَلَيْكَ اَ۬لْقُرْءَانَ لِتَشْقى",
    'long':
        "طَه۪ۖ مَآ أَنزَلْنَا عَلَيْكَ اَ۬لْقُرْءَانَ لِتَشْقى إِلَّا تَذْكِرَةٗ لِّمَنْ يَّخْش۪يٰۖ تَنزِيلاٗ مِّمَّنْ خَلَقَ اَ۬لَارْضَ وَالسَّمَٰوَٰتِ اِ۬لْعُلَيۖ اَ۬لرَّحْمَٰنُ عَلَي اَ۬لْعَرْشِ اِ۪سْتَو۪يٰۖ لَهُۥ مَا فِے اِ۬لسَّمَٰوَٰتِ وَمَا فِے اِ۬لَارْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ اَ۬لثَّر۪ىٰۖ",
    'surat': 'طه'
  },
  33: {
    'number': 33,
    'short':
        "اَ۪قْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِے غَفْلَةٖ مُّعْرِضُونَۖ",
    'long':
        "اَ۪قْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِے غَفْلَةٖ مُّعْرِضُونَۖ مَا يَاتِيهِم مِّن ذِكْرٖ مِّن رَّبِّهِم مُّحْدَثٍ اِلَّا اَ۪سْتَمَعُوهُ وَهُمْ يَلْعَبُونَ لَٰهِيَةٗ قُلُوبُهُمْۖ وَأَسَرُّواْ اُ۬لنَّجْوَي اَ۬لذِينَ ظَلَمُواْ هَلْ هَٰذَآ إِلَّا بَشَرٞ مِّثْلُكُمُۥٓۖ أَفَتَاتُونَ اَ۬لسِّحْرَ وَأَنتُمْ تُبْصِرُونَۖ قُل رَّبِّے يَعْلَمُ اُ۬لْقَوْلَ فِے اِ۬لسَّمَآءِ وَالَارْضِۖ وَهُوَ اَ۬لسَّمِيعُ اُ۬لْعَلِيمُۖ",
    'surat': 'الأنبياء'
  },
  34: {
    'number': 34,
    'short':
        "يَٰٓأَيُّهَا اَ۬لنَّاسُ اُ۪تَّقُواْ رَبَّكُمُۥٓۖ إِنَّ زَلْزَلَةَ اَ۬لسَّاعَةِ شَےْءٌ عَظِيمٞۖ",
    'long':
        "يَٰٓأَيُّهَا اَ۬لنَّاسُ اُ۪تَّقُواْ رَبَّكُمُۥٓۖ إِنَّ زَلْزَلَةَ اَ۬لسَّاعَةِ شَےْءٌ عَظِيمٞۖ يَوْمَ تَرَوْنَهَا تَذْهَلُ كُلُّ مُرْضِعَةٍ عَمَّآ أَرْضَعَتْ وَتَضَعُ كُلُّ ذَاتِ حَمْلٍ حَمْلَهَا وَتَرَي اَ۬لنَّاسَ سُكَٰر۪ىٰ وَمَا هُم بِسُكَٰر۪ىٰ وَلَٰكِنَّ عَذَابَ اَ۬للَّهِ شَدِيدٞۖ",
    'surat': 'الحج'
  },
  35: {
    'number': 35,
    'short':
        "قَدَ اَفْلَحَ اَ۬لْمُومِنُونَۖ اَ۬لذِينَ هُمْ فِے صَلَاتِهِمْ خَٰشِعُونَۖ",
    'long':
        "قَدَ اَفْلَحَ اَ۬لْمُومِنُونَۖ اَ۬لذِينَ هُمْ فِے صَلَاتِهِمْ خَٰشِعُونَۖ وَالذِينَ هُمْ عَنِ اِ۬للَّغْوِ مُعْرِضُونَۖ وَالذِينَ هُمْ لِلزَّكَوٰةِ فَٰعِلُونَۖ وَالذِينَ هُمْ لِفُرُوجِهِمْ حَٰفِظُونَ إِلَّا عَلَى أَزْوَٰجِهِمُۥٓ أَوْ مَا مَلَكَتَ اَيْمَٰنُهُمْ فَإِنَّهُمْ غَيْرُ مَلُومِينَۖ فَمَنِ اِ۪بْتَغ۪يٰ وَرَآءَ ذَٰلِكَ فَأُوْلَٰٓئِكَ هُمُ اُ۬لْعَادُونَۖ وَالذِينَ هُمْ لِأَمَٰنَٰتِهِمْ وَعَهْدِهِمْ رَٰعُونَۖ وَالذِينَ هُمْ عَلَيٰ صَلَوَٰتِهِمْ يُحَافِظُونَ أُوْلَٰٓئِكَ هُمُ اُ۬لْوَٰرِثُونَ اَ۬لذِينَ يَرِثُونَ اَ۬لْفِرْدَوْسَۖ هُمْ فِيهَا خَٰلِدُونَۖ",
    'surat': 'المومنون'
  },
  36: {
    'number': 36,
    'short':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُواْ لَا تَتَّبِعُواْ خُطْوَٰتِ اِ۬لشَّيْطَٰنِۖ",
    'long':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُواْ لَا تَتَّبِعُواْ خُطْوَٰتِ اِ۬لشَّيْطَٰنِۖ وَمَنْ يَّتَّبِعْ خُطْوَٰتِ اِ۬لشَّيْطَٰنِ فَإِنَّهُۥ يَامُرُ بِالْفَحْشَآءِ وَالْمُنكَرِۖ وَلَوْلَا فَضْلُ اُ۬للَّهِ عَلَيْكُمْ وَرَحْمَتُهُۥ مَا زَكَيٰ مِنكُم مِّنَ اَحَدٍ اَبَداٗ وَلَٰكِنَّ اَ۬للَّهَ يُزَكِّے مَنْ يَّشَآءُۖ وَاللَّهُ سَمِيعٌ عَلِيمٞۖ",
    'surat': 'النور'
  },
  37: {
    'number': 37,
    'short': "وَقَالَ اَ۬لذِينَ لَا يَرْجُونَ لِقَآءَنَا",
    'long':
        "وَقَالَ اَ۬لذِينَ لَا يَرْجُونَ لِقَآءَنَا لَوْلَآ أُنزِلَ عَلَيْنَا اَ۬لْمَلَٰٓئِكَةُ أَوْ نَر۪يٰ رَبَّنَاۖ لَقَدِ اِ۪سْتَكْبَرُواْ فِےٓ أَنفُسِهِمْ وَعَتَوْ عُتُوّاٗ كَبِيراٗۖ يَوْمَ يَرَوْنَ اَ۬لْمَلَٰٓئِكَةَ لَا بُشْر۪يٰ يَوْمَئِذٖ لِّلْمُجْرِمِينَ وَيَقُولُونَ حِجْراٗ مَّحْجُوراٗۖ وَقَدِمْنَآ إِلَيٰ مَا عَمِلُواْ مِنْ عَمَلٖ فَجَعَلْنَٰهُ هَبَآءٗ مَّنثُوراًۖ ",
    'surat': 'الفرقان'
  },
  38: {
    'number': 38,
    'short': "قَالُوٓاْ أَنُومِنُ لَكَ وَاتَّبَعَكَ اَ۬لَارْذَلُونَۖ",
    'long':
        "قَالُوٓاْ أَنُومِنُ لَكَ وَاتَّبَعَكَ اَ۬لَارْذَلُونَۖ قَالَ وَمَا عِلْمِے بِمَا كَانُواْ يَعْمَلُونَۖ إِنْ حِسَابُهُمُۥٓ إِلَّا عَلَيٰ رَبِّے لَوْ تَشْعُرُونَۖ وَمَآ أَنَا بِطَارِدِ اِ۬لْمُومِنِينَ إِنَ اَنَا إِلَّا نَذِيرٞ مُّبِينٞۖ قَالُواْ لَئِن لَّمْ تَنتَهِ يَٰنُوحُ لَتَكُونَنَّ مِنَ اَ۬لْمَرْجُومِينَ قَالَ رَبِّ إِنَّ قَوْمِے كَذَّبُونِ فَافْتَحْ بَيْنِے وَبَيْنَهُمْ فَتْحاٗ وَنَجِّنِے وَمَن مَّعِيَ مِنَ اَ۬لْمُومِنِينَۖ فَأَنجَيْنَٰهُ وَمَن مَّعَهُۥ فِے اِ۬لْفُلْكِ اِ۬لْمَشْحُونِۖ ثُمَّ أَغْرَقْنَا بَعْدُ اُ۬لْبَاقِينَۖ",
    'surat': 'الشعراء'
  },
  39: {
    'number': 39,
    'short': "فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ",
    'long':
        "فَمَا كَانَ جَوَابَ قَوْمِهِۦٓ إِلَّآ أَن قَالُوٓاْ أَخْرِجُوٓاْ ءَالَ لُوطٖ مِّن قَرْيَتِكُمُۥٓۖ إِنَّهُمُۥٓ أُنَاسٞ يَتَطَهَّرُونَۖ فَأَنجَيْنَٰهُ وَأَهْلَهُۥٓ إِلَّا اَ۪مْرَأَتَهُۥ قَدَّرْنَٰهَا مِنَ اَ۬لْغَٰبِرِينَۖ وَأَمْطَرْنَا عَلَيْهِم مَّطَراٗۖ فَسَآءَ مَطَرُ اُ۬لْمُنذَرِينَۖ قُلِ اِ۬لْحَمْدُ لِلهِ وَسَلَٰمٌ عَلَيٰ عِبَادِهِ اِ۬لذِينَ اَ۪صْطَفىْٰ ءَآللَّهُ خَيْرٌ اَمَّا تُشْرِكُونَۖ",
    'surat': 'النمل'
  },
  40: {
    'number': 40,
    'short':
        "وَلَقَدْ وَصَّلْنَا لَهُمُ اُ۬لْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَۖ",
    'long':
        "وَلَقَدْ وَصَّلْنَا لَهُمُ اُ۬لْقَوْلَ لَعَلَّهُمْ يَتَذَكَّرُونَۖ  اَ۬لذِينَ ءَاتَيْنَٰهُمُ اُ۬لْكِتَٰبَ مِن قَبْلِهِۦ هُم بِهِۦ يُومِنُونَۖ وَإِذَا يُتْل۪ى عَلَيْهِمْ قَالُوٓاْ ءَامَنَّا بِهِۦٓ إِنَّهُ اُ۬لْحَقُّ مِن رَّبِّنَآ إِنَّا كُنَّا مِن قَبْلِهِۦ مُسْلِمِينَۖ أُوْلَٰٓئِكَ يُوتَوْنَ أَجْرَهُم مَّرَّتَيْنِ بِمَا صَبَرُواْ وَيَدْرَءُونَ بِالْحَسَنَةِ اِ۬لسَّيِّئَةَ وَمِمَّا رَزَقْنَٰهُمْ يُنفِقُونَۖ",
    'surat': 'القصص'
  },
  41: {
    'number': 41,
    'short':
        "وَلَا تُجَٰدِلُوٓاْ أَهْلَ اَ۬لْكِتَٰبِ إِلَّا بِالتِے هِيَ أَحْسَنُ إِلَّا اَ۬لذِينَ ظَلَمُواْ مِنْهُمْۖ",
    'long':
        "وَلَا تُجَٰدِلُوٓاْ أَهْلَ اَ۬لْكِتَٰبِ إِلَّا بِالتِے هِيَ أَحْسَنُ إِلَّا اَ۬لذِينَ ظَلَمُواْ مِنْهُمْۖ وَقُولُوٓاْ ءَامَنَّا بِالذِےٓ أُنزِلَ إِلَيْنَا وَأُنزِلَ إِلَيْكُمْ وَإِلَٰهُنَا وَإِلَٰهُكُمْ وَٰحِدٞ وَنَحْنُ لَهُۥ مُسْلِمُونَۖ وَكَذَٰلِكَ أَنزَلْنَآ إِلَيْكَ اَ۬لْكِتَٰبَۖ فَالذِينَ ءَاتَيْنَٰهُمُ اُ۬لْكِتَٰبَ يُومِنُونَ بِهِۦ وَمِنْ هَٰٓؤُلَآءِ مَنْ يُّومِنُ بِهِۦۖ وَمَا يَجْحَدُ بِـَٔايَٰتِنَآ إِلَّا اَ۬لْكَٰفِرُونَۖ",
    'surat': 'العنكبوت'
  },
  42: {
    'number': 42,
    'short': "وَمَنْ يُّسْلِمْ وَجْهَهُۥٓ إِلَي اَ۬للَّهِ وَهُوَ مُحْسِنٞ",
    'long':
        "وَمَنْ يُّسْلِمْ وَجْهَهُۥٓ إِلَي اَ۬للَّهِ وَهُوَ مُحْسِنٞ فَقَدِ اِ۪سْتَمْسَكَ بِالْعُرْوَةِ اِ۬لْوُثْق۪يٰۖ وَإِلَي اَ۬للَّهِ عَٰقِبَةُ اُ۬لُامُورِۖ وَمَن كَفَرَ فَلَا يُحْزِنكَ كُفْرُهُۥٓۖ إِلَيْنَا مَرْجِعُهُمْ فَنُنَبِّئُهُم بِمَا عَمِلُوٓاْۖ إِنَّ اَ۬للَّهَ عَلِيمُۢ بِذَاتِ اِ۬لصُّدُورِۖ نُمَتِّعُهُمْ قَلِيلاٗ ثُمَّ نَضْطَرُّهُمُۥٓ إِلَيٰ عَذَابٍ غَلِيظٖۖ",
    'surat': 'لقمان'
  },
  43: {
    'number': 43,
    'short': "وَمَنْ يَّقْنُتْ مِنكُنَّ لِلهِ وَرَسُولِهِۦ",
    'long':
        "وَمَنْ يَّقْنُتْ مِنكُنَّ لِلهِ وَرَسُولِهِۦ وَتَعْمَلْ صَٰلِحاٗ نُّوتِهَآ أَجْرَهَا مَرَّتَيْنِ وَأَعْتَدْنَا لَهَا رِزْقاٗ كَرِيماٗۖ يَٰنِسَآءَ اَ۬لنَّبِےٓءِ لَسْتُنَّ كَأَحَدٖ مِّنَ اَ۬لنِّسَآءِ انِ اِ۪تَّقَيْتُنَّۖ فَلَا تَخْضَعْنَ بِالْقَوْلِ فَيَطْمَعَ اَ۬لذِے فِے قَلْبِهِۦ مَرَضٞ وَقُلْنَ قَوْلاٗ مَّعْرُوفاٗ وَقَرْنَ فِے بُيُوتِكُنَّ وَلَا تَبَرَّجْنَ تَبَرُّجَ اَ۬لْجَٰهِلِيَّةِ اِ۬لُاول۪يٰۖ وَأَقِمْنَ اَ۬لصَّلَوٰةَ وَءَاتِينَ اَ۬لزَّكَوٰةَ وَأَطِعْنَ اَ۬للَّهَ وَرَسُولَهُۥٓۖ إِنَّمَا يُرِيدُ اُ۬للَّهُ لِيُذْهِبَ عَنكُمُ اُ۬لرِّجْسَ أَهْلَ اَ۬لْبَيْتِ وَيُطَهِّرَكُمْ تَطْهِيراٗۖ",
    'surat': 'الأحزاب'
  },
  44: {
    'number': 44,
    'short':
        "قُلْ مَنْ يَّرْزُقُكُم مِّنَ اَ۬لسَّمَٰوَٰتِ وَالَارْضِ قُلِ اِ۬للَّهُۖ",
    'long':
        "قُلْ مَنْ يَّرْزُقُكُم مِّنَ اَ۬لسَّمَٰوَٰتِ وَالَارْضِ قُلِ اِ۬للَّهُۖ وَإِنَّآ أَوِ اِيَّاكُمْ لَعَلَيٰ هُديً اَوْ فِے ضَلَٰلٖ مُّبِينٖۖ قُل لَّا تُسْـَٔلُونَ عَمَّآ أَجْرَمْنَا وَلَا نُسْـَٔلُ عَمَّا تَعْمَلُونَۖ قُلْ يَجْمَعُ بَيْنَنَا رَبُّنَا ثُمَّ يَفْتَحُ بَيْنَنَا بِالْحَقِّ وَهُوَ اَ۬لْفَتَّاحُ اُ۬لْعَلِيمُۖ",
    'surat': 'سبأ'
  },
  45: {
    'number': 45,
    'short': "وَمَآ أَنزَلْنَا عَلَى قَوْمِهِۦ مِنۢ بَعْدِهِۦ",
    'long':
        "وَمَآ أَنزَلْنَا عَلَى قَوْمِهِۦ مِنۢ بَعْدِهِۦ مِن جُندٖ مِّنَ اَ۬لسَّمَآءِ وَمَا كُنَّا مُنزِلِينَۖ إِن كَانَتِ اِلَّا صَيْحَةٗ وَٰحِدَةٗ فَإِذَا هُمْ خَٰمِدُونَۖ يَٰحَسْرَةً عَلَي اَ۬لْعِبَادِۖ مَا يَاتِيهِم مِّن رَّسُولٍ اِلَّا كَانُواْ بِهِۦ يَسْتَهْزِءُونَۖ أَلَمْ يَرَوْاْ كَمَ اَهْلَكْنَا قَبْلَهُم مِّنَ اَ۬لْقُرُونِ أَنَّهُمُۥٓ إِلَيْهِمْ لَا يَرْجِعُونَۖ وَإِن كُلّٞ لَّمَا جَمِيعٞ لَّدَيْنَا مُحْضَرُونَۖ",
    'surat': 'يس'
  },
  46: {
    'number': 46,
    'short': "فَنَبَذْنَٰهُ بِالْعَرَآءِ وَهُوَ سَقِيمٞۖ",
    'long':
        "فَنَبَذْنَٰهُ بِالْعَرَآءِ وَهُوَ سَقِيمٞۖ وَأَنۢبَتْنَا عَلَيْهِ شَجَرَةٗ مِّنْ يَّقْطِينٖۖ وَأَرْسَلْنَٰهُ إِلَيٰ مِاْئَةِ أَلْفٍ اَوْ يَزِيدُونَۖ فَـَٔامَنُواْ فَمَتَّعْنَٰهُمُۥٓ إِلَيٰ حِينٖۖ فَاسْتَفْتِهِمُۥٓ أَلِرَبِّكَ اَ۬لْبَنَاتُ وَلَهُمُ اُ۬لْبَنُونَۖ أَمْ خَلَقْنَا اَ۬لْمَلَٰٓئِكَةَ إِنَٰثاٗ وَهُمْ شَٰهِدُونَۖ أَلَآ إِنَّهُم مِّنِ اِفْكِهِمْ لَيَقُولُونَ وَلَدَ اَ۬للَّهُ وَإِنَّهُمْ لَكَٰذِبُونَۖ أَصْطَفَي اَ۬لْبَنَاتِ عَلَي اَ۬لْبَنِينَۖ مَا لَكُمْ كَيْفَ تَحْكُمُونَۖ أَفَلَا تَذَّكَّرُونَۖ",
    'surat': 'الصافات'
  },
  47: {
    'number': 47,
    'short': "فَمَنَ اَظْلَمُ مِمَّن كَذَبَ عَلَى اَ۬للَّهِ",
    'long':
        "فَمَنَ اَظْلَمُ مِمَّن كَذَبَ عَلَي اَ۬للَّهِ وَكَذَّبَ بِالصِّدْقِ إِذْ جَآءَهُۥٓۖ أَلَيْسَ فِے جَهَنَّمَ مَثْويٗ لِّلْكٰ۪فِرِينَۖ  وَالذِے جَآءَ بِالصِّدْقِ وَصَدَّقَ بِهِۦٓ أُوْلَٰٓئِكَ هُمُ اُ۬لْمُتَّقُونَۖ لَهُم مَّا يَشَآءُونَ عِندَ رَبِّهِمْۖ ذَٰلِكَ جَزَٰٓؤُاْ اُ۬لْمُحْسِنِينَ لِيُكَفِّرَ اَ۬للَّهُ عَنْهُمُۥٓ أَسْوَأَ اَ۬لذِے عَمِلُواْ وَيَجْزِيَهُمُۥٓ أَجْرَهُم بِأَحْسَنِ اِ۬لذِے كَانُواْ يَعْمَلُونَۖ أَلَيْسَ اَ۬للَّهُ بِكَافٍ عَبْدَهُۥۖ",
    'surat': 'الزمر'
  },
  48: {
    'number': 48,
    'short':
        "وَيَٰقَوْمِ مَا لِيَ أَدْعُوكُمُۥٓ إِلَى اَ۬لنَّجَوٰةِ وَتَدْعُونَنِےٓ إِلَى النار",
    'long':
        "وَيَٰقَوْمِ مَا لِيَ أَدْعُوكُمُۥٓ إِلَى اَ۬لنَّجَوٰةِ وَتَدْعُونَنِےٓ إِلَى اَ۬لنّ۪ارِۖ تَدْعُونَنِے لِأَكْفُرَ بِاللَّهِ وَأُشْرِكَ بِهِۦ مَا لَيْسَ لِے بِهِۦ عِلْمٞ وَأَنَآ أَدْعُوكُمُۥٓ إِلَى اَ۬لْعَزِيزِ اِ۬لْغَفّٰ۪رِۖ لَا جَرَمَ أَنَّمَا تَدْعُونَنِےٓ إِلَيْهِ لَيْسَ لَهُۥ دَعْوَةٞ فِے اِ۬لدُّنْي۪ا وَلَا فِے اِ۬لَاخِرَةِ وَأَنَّ مَرَدَّنَآ إِلَى اَ۬للَّهِ وَأَنَّ اَ۬لْمُسْرِفِينَ هُمُۥٓ أَصْحَٰبُ اُ۬لنّ۪ارِۖ",
    'surat': 'غافر'
  },
  49: {
    'number': 49,
    'short': "إِلَيْهِ يُرَدُّ عِلْمُ اُ۬لسَّاعَةِۖ",
    'long':
        "إِلَيْهِ يُرَدُّ عِلْمُ اُ۬لسَّاعَةِۖ وَمَا تَخْرُجُ مِن ثَمَرَٰتٖ مِّنَ اَكْمَامِهَا وَمَا تَحْمِلُ مِنُ ا۟نث۪ى وَلَا تَضَعُ إِلَّا بِعِلْمِهِۦۖ وَيَوْمَ يُنَادِيهِمُۥٓ أَيْنَ شُرَكَآءِے قَالُوٓاْ ءَاذَنَّٰكَ مَامِنَّا مِن شَهِيدٖۖ وَضَلَّ عَنْهُم مَّا كَانُواْ يَدْعُونَ مِن قَبْلُۖ وَظَنُّواْ مَا لَهُم مِّن مَّحِيصٖۖ",
    'surat': 'فصلت'
  },
  50: {
    'number': 50,
    'short':
        "قُلَ اَوَلَوْ جِئْتُكُم بِأَهْد۪ى مِمَّا وَجَدتُّمْ عَلَيْهِ ءَابَآءَكُمْۖ",
    'long':
        "قُلَ اَوَلَوْ جِئْتُكُم بِأَهْد۪ى مِمَّا وَجَدتُّمْ عَلَيْهِ ءَابَآءَكُمْۖ قَالُوٓاْ إِنَّا بِمَآ أُرْسِلْتُم بِهِۦ كَٰفِرُونَۖ فَانتَقَمْنَا مِنْهُمْ فَانظُرْ كَيْفَ كَانَ عَٰقِبَةُ اُ۬لْمُكَذِّبِينَۖ وَإِذْ قَالَ إِبْرَٰهِيمُ لِأَبِيهِ وَقَوْمِهِۦٓ إِنَّنِے بَرَآءٞ مِّمَّا تَعْبُدُونَ إِلَّا اَ۬لذِے فَطَرَنِے فَإِنَّهُۥ سَيَهْدِينِۖ",
    'surat': 'الزخرف'
  },
  51: {
    'number': 51,
    'short':
        "ح۪مِٓۖ تَنزِيلُ اُ۬لْكِتَٰبِ مِنَ اَ۬للَّهِ اِ۬لْعَزِيزِ اِ۬لْحَكِيمِۖ",
    'long':
        "ح۪مِٓۖ تَنزِيلُ اُ۬لْكِتَٰبِ مِنَ اَ۬للَّهِ اِ۬لْعَزِيزِ اِ۬لْحَكِيمِۖ مَا خَلَقْنَا اَ۬لسَّمَٰوَٰتِ وَالَارْضَ وَمَا بَيْنَهُمَآ إِلَّا بِالْحَقِّ وَأَجَلٖ مُّسَمّيٗۖ وَالذِينَ كَفَرُواْ عَمَّآ أُنذِرُواْ مُعْرِضُونَۖ قُلَ اَرَٰٓيْتُم مَّا تَدْعُونَ مِن دُونِ اِ۬للَّهِ أَرُونِے مَاذَا خَلَقُواْ مِنَ اَ۬لَارْضِ أَمْ لَهُمْ شِرْكٞ فِے اِ۬لسَّمَٰوَٰتِۖ اِ۪يتُونِے بِكِتَٰبٖ مِّن قَبْلِ هَٰذَآ أَوَ اَثَٰرَةٖ مِّنْ عِلْمٍ اِن كُنتُمْ صَٰدِقِينَۖ ",
    'surat': 'الأحقاف'
  },
  52: {
    'number': 52,
    'short': "لَّقَدْ رَضِيَ اَ۬للَّهُ عَنِ اِ۬لْمُومِنِينَ",
    'long':
        "لَّقَدْ رَضِيَ اَ۬للَّهُ عَنِ اِ۬لْمُومِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ اَ۬لشَّجَرَةِ فَعَلِمَ مَا فِے قُلُوبِهِمْ فَأَنزَلَ اَ۬لسَّكِينَةَ عَلَيْهِمْ وَأَثَٰبَهُمْ فَتْحاٗ قَرِيباٗ (18) وَمَغَانِمَ كَثِيرَةٗ يَاخُذُونَهَاۖ وَكَانَ اَ۬للَّهُ عَزِيزاً حَكِيماٗۖ (19) وَعَدَكُمُ اُ۬للَّهُ مَغَانِمَ كَثِيرَةٗ تَاخُذُونَهَا فَعَجَّلَ لَكُمْ هَٰذِهِۦ وَكَفَّ أَيْدِيَ اَ۬لنَّاسِ عَنكُمْ وَلِتَكُونَ ءَايَةٗ لِّلْمُومِنِينَ وَيَهْدِيَكُمْ صِرَٰطاٗ مُّسْتَقِيماٗۖ ",
    'surat': 'الفتح'
  },
  53: {
    'number': 53,
    'short': "قَالَ فَمَا خَطْبُكُمُۥٓ أَيُّهَا اَ۬لْمُرْسَلُونَۖ",
    'long':
        "قَالَ فَمَا خَطْبُكُمُۥٓ أَيُّهَا اَ۬لْمُرْسَلُونَۖ قَالُوٓاْ إِنَّآ أُرْسِلْنَآ إِلَيٰ قَوْمٖ مُّجْرِمِينَ لِنُرْسِلَ عَلَيْهِمْ حِجَارَةٗ مِّن طِينٖ مُّسَوَّمَةً عِندَ رَبِّكَ لِلْمُسْرِفِينَۖ فَأَخْرَجْنَا مَن كَانَ فِيهَا مِنَ اَ۬لْمُومِنِينَ فَمَا وَجَدْنَا فِيهَا غَيْرَ بَيْتٖ مِّنَ اَ۬لْمُسْلِمِينَ وَتَرَكْنَا فِيهَآ ءَايَةٗ لِّلذِينَ يَخَافُونَ اَ۬لْعَذَابَ اَ۬لَالِيمَۖ ",
    'surat': 'الذاريات'
  },
  54: {
    'number': 54,
    'short': "اِ۬لرَّحْمَٰنُ عَلَّمَ اَ۬لْقُرْءَانَۖ",
    'long':
        "اِ۬لرَّحْمَٰنُ عَلَّمَ اَ۬لْقُرْءَانَۖ خَلَقَ اَ۬لِانسَٰنَ عَلَّمَهُ اُ۬لْبَيَانَۖ اَ۬لشَّمْسُ وَالْقَمَرُ بِحُسْبَانٖۖ وَالنَّجْمُ وَالشَّجَرُ يَسْجُدَٰنِۖ وَالسَّمَآءَ رَفَعَهَا وَوَضَعَ اَ۬لْمِيزَانَ أَلَّا تَطْغَوْاْ فِے اِ۬لْمِيزَانِ وَأَقِيمُواْ اُ۬لْوَزْنَ بِالْقِسْطِ وَلَا تُخْسِرُواْ اُ۬لْمِيزَانَۖ وَالَارْضَ وَضَعَهَا لِلَانَامِ فِيهَا فَٰكِهَةٞ وَالنَّخْلُ ذَاتُ اُ۬لَاكْمَامِ وَالْحَبُّ ذُو اُ۬لْعَصْفِ وَالرَّيْحَانُۖ",
    'surat': 'الرحمان'
  },
  55: {
    'number': 55,
    'short': "قَدْ سَمِعَ اَ۬للَّهُ قَوْلَ اَ۬لتِے تُجَٰدِلُكَ",
    'long':
        "قَدْ سَمِعَ اَ۬للَّهُ قَوْلَ اَ۬لتِے تُجَٰدِلُكَ فِے زَوْجِهَا وَتَشْتَكِےٓ إِلَي اَ۬للَّهِ وَاللَّهُ يَسْمَعُ تَحَاوُرَكُمَآۖ إِنَّ اَ۬للَّهَ سَمِيعُۢ بَصِيرٌۖ اِ۬لذِينَ يَظَّهَّرُونَ مِنكُم مِّن نِّسَآئِهِم مَّا هُنَّ أُمَّهَٰتِهِمُۥٓۖ إِنُ ا۟مَّهَٰتُهُمُۥٓ إِلَّا اَ۬ل۪ےْ وَلَدْنَهُمْۖ وَإِنَّهُمْ لَيَقُولُونَ مُنكَراٗ مِّنَ اَ۬لْقَوْلِ وَزُوراٗۖ وَإِنَّ اَ۬للَّهَ لَعَفُوٌّ غَفُورٞۖ",
    'surat': 'المجادلة'
  },
  56: {
    'number': 56,
    'short': "يُسَبِّحُ لِلهِ مَا فِے اِ۬لسَّمَٰوَٰتِ وَمَا فِے اِ۬لَارْضِ",
    'long':
        "يُسَبِّحُ لِلهِ مَا فِے اِ۬لسَّمَٰوَٰتِ وَمَا فِے اِ۬لَارْضِ اِ۬لْمَلِكِ اِ۬لْقُدُّوسِ اِ۬لْعَزِيزِ اِ۬لْحَكِيمِۖ هُوَ اَ۬لذِے بَعَثَ فِے اِ۬لُامِّيِّـۧنَ رَسُولاٗ مِّنْهُمْ يَتْلُواْ عَلَيْهِمُۥٓ ءَايَٰتِهِۦ وَيُزَكِّيهِمْ وَيُعَلِّمُهُمُ اُ۬لْكِتَٰبَ وَالْحِكْمَةَ وَإِن كَانُواْ مِن قَبْلُ لَفِے ضَلَٰلٖ مُّبِينٖ وَءَاخَرِينَ مِنْهُمْ لَمَّا يَلْحَقُواْ بِهِمْۖ وَهُوَ اَ۬لْعَزِيزُ اُ۬لْحَكِيمُۖ ذَٰلِكَ فَضْلُ اُ۬للَّهِ يُوتِيهِ مَنْ يَّشَآءُۖ وَاللَّهُ ذُو اُ۬لْفَضْلِ اِ۬لْعَظِيمِۖ",
    'surat': 'الجمعة'
  },
  57: {
    'number': 57,
    'short':
        "تَبَٰرَكَ اَ۬لذِے بِيَدِهِ اِ۬لْمُلْكُ وَهُوَ عَلَيٰ كُلِّ شَےْءٖ قَدِيرٌۖ ",
    'long':
        "تَبَٰرَكَ اَ۬لذِے بِيَدِهِ اِ۬لْمُلْكُ وَهُوَ عَلَيٰ كُلِّ شَےْءٖ قَدِيرٌۖ اِ۬لذِے خَلَقَ اَ۬لْمَوْتَ وَالْحَيَوٰةَ لِيَبْلُوَكُمُۥٓ أَيُّكُمُۥٓ أَحْسَنُ عَمَلاٗۖ وَهُوَ اَ۬لْعَزِيزُ اُ۬لْغَفُورُۖ اُ۬لذِے خَلَقَ سَبْعَ سَمَٰوَٰتٖ طِبَاقاٗۖ مَّا تَر۪يٰ فِے خَلْقِ اِ۬لرَّحْمَٰنِ مِن تَفَٰوُتٖۖ فَارْجِعِ اِ۬لْبَصَرَ هَلْ تَر۪يٰ مِن فُطُورٖۖ ثُمَّ اَ۪رْجِعِ اِ۬لْبَصَرَ كَرَّتَيْنِ يَنقَلِبِ اِلَيْكَ اَ۬لْبَصَرُ خَاسِئاٗ وَهُوَ حَسِيرٞۖ ",
    'surat': 'الملك'
  },
  58: {
    'number': 58,
    'short': "قُلُ ا۟وحِيَ إِلَيَّ أَنَّهُ اُ۪سْتَمَعَ نَفَرٞ مِّنَ اَ۬لْجِنِّ",
    'long':
        "قُلُ ا۟وحِيَ إِلَيَّ أَنَّهُ اُ۪سْتَمَعَ نَفَرٞ مِّنَ اَ۬لْجِنِّ فَقَالُوٓاْ إِنَّا سَمِعْنَا قُرْءَاناً عَجَباٗ يَهْدِےٓ إِلَي اَ۬لرُّشْدِ فَـَٔامَنَّا بِهِۦ وَلَن نُّشْرِكَ بِرَبِّنَآ أَحَداٗۖ وَإِنَّهُۥ تَعَٰل۪يٰ جَدُّ رَبِّنَا مَا اَ۪تَّخَذَ صَٰحِبَةٗ وَلَا وَلَداٗۖ وَإِنَّهُۥ كَانَ يَقُولُ سَفِيهُنَا عَلَي اَ۬للَّهِ شَطَطاٗۖ وَإِنَّا ظَنَنَّآ أَن لَّن تَقُولَ اَ۬لِانسُ وَالْجِنُّ عَلَي اَ۬للَّهِ كَذِباٗۖ ",
    'surat': 'الجن'
  },
  59: {
    'number': 59,
    'short': "عَمَّ يَتَسَآءَلُونَ",
    'long':
        "عَمَّ يَتَسَآءَلُونَ عَنِ اِ۬لنَّبَإِ اِ۬لْعَظِيمِ اِ۬لذِے هُمْ فِيهِ مُخْتَلِفُونَۖ كَلَّا سَيَعْلَمُونَ ثُمَّ كَلَّا سَيَعْلَمُونَۖ أَلَمْ نَجْعَلِ اِ۬لَارْضَ مِهَٰداٗ وَالْجِبَالَ أَوْتَاداٗ وَخَلَقْنَٰكُمُۥٓ أَزْوَٰجاٗ وَجَعَلْنَا نَوْمَكُمْ سُبَاتاٗ وَجَعَلْنَا اَ۬ليْلَ لِبَاساٗ وَجَعَلْنَا اَ۬لنَّهَارَ مَعَاشاٗ وَبَنَيْنَا فَوْقَكُمْ سَبْعاٗ شِدَاداٗ وَجَعَلْنَا سِرَاجاٗ وَهَّاجاٗ وَأَنزَلْنَا مِنَ اَ۬لْمُعْصِرَٰتِ مَآءٗ ثَجَّاجاٗ لِّنُخْرِجَ بِهِۦ حَبّاٗ وَنَبَاتاٗ وَجَنَّٰتٍ اَلْفَافاًۖ اِنَّ يَوْمَ اَ۬لْفَصْلِ كَانَ مِيقَٰتاٗ",
    'surat': 'النبأ'
  },
  60: {
    'number': 60,
    'short': "سَبِّحِ اِ۪سْمَ رَبِّكَ اَ۬لَاعْلَى",
    'long':
        "سَبِّحِ اِ۪سْمَ رَبِّكَ اَ۬لَاعْلَى اَ۬لذِے خَلَقَ فَسَوّ۪ى وَالذِے قَدَّرَ فَهَد۪ى وَالذِےٓ أَخْرَجَ اَ۬لْمَرْع۪ى فَجَعَلَهُۥ غُثَآءً اَحْو۪ى سَنُقْرِئُكَ فَلَا تَنس۪ى إِلَّا مَا شَآءَ اَ۬للَّهُۖ إِنَّهُۥ يَعْلَمُ اُ۬لْجَهْرَ وَمَا يَخْف۪ى وَنُيَسِّرُكَ لِلْيُسْر۪ى فَذَكِّرِ اِن نَّفَعَتِ اِ۬لذِّكْر۪ى سَيَذَّكَّرُ مَنْ يَّخْش۪ى وَيَتَجَنَّبُهَا اَ۬لَاشْقَى اَ۬لذِے يَصْلَي اَ۬لنَّارَ اَ۬لْكُبْر۪ى ثُمَّ لَا يَمُوتُ فِيهَا وَلَا يَحْي۪ى قَدَ اَفْلَحَ مَن تَزَكّ۪ى وَذَكَرَ اَ۪سْمَ رَبِّهِۦ فَصَلّ۪ى بَلْ تُوثِرُونَ اَ۬لْحَيَوٰةَ اَ۬لدُّنْي۪ا وَالَاخِرَةُ خَيْرٞ وَأَبْق۪ى إِنَّ هَٰذَا لَفِے اِ۬لصُّحُفِ اِ۬لُاول۪ى صُحُفِ إِبْرَٰهِيمَ وَمُوس۪ى",
    'surat': 'الأعلى'
  }
};

Map getAlAhzabMap() {
  return hizbsMap;
}
