// import 'package:flutter/material.dart';

const Map hizbsMap = {
  1: {
    'number': 1,
    'short': "اِ۬لْحَمْدُ لِلهِ رَبِّ اِ۬لْعَٰالَمِينَ",
    'long':
        "اِ۬لْحَمْدُ لِلهِ رَبِّ اِ۬لْعَٰلَمِينَ اَ۬لرَّحْمَٰنِ اِ۬لرَّحِيمِ مَلِكِ يَوْمِ اِ۬لدِّينِۖ إِيَّاكَ نَعْبُدُ وَإِيَّاكَ نَسْتَعِينُۖ اُ۪هْدِنَا اَ۬لصِّرَٰطَ اَ۬لْمُسْتَقِيمَ صِرَٰطَ اَ۬لذِينَ أَنْعَمْتَ عَلَيْهِمْ غَيْرِ اِ۬لْمَغْضُوبِ عَلَيْهِمْ وَلَا اَ۬لضَّآلِّينَۖ",
    'surat': 'الفاتحة'
  },
  2: {
    'number': 2,
    'short': "وَإِذَا لَقُواْ اُ۬لذِينَ ءَامَنُواْ",
    'long':
        "وَإِذَا لَقُواْ اُ۬لذِينَ ءَامَنُواْ قَالُوٓاْ ءَامَنَّاۖ وَإِذَا خَلَا بَعْضُهُمُۥٓ إِلَيٰ بَعْضٖ قَالُوٓاْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ اَ۬للَّهُ عَلَيْكُمْ لِيُحَآجُّوكُم بِهِۦ عِندَ رَبِّكُمُۥٓۖ أَفَلَا تَعْقِلُونَۖ أَوَلَا يَعْلَمُونَ أَنَّ اَ۬للَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَۖ",
    'surat': 'البقرة'
  },
  3: {
    'number': 3,
    'short': "سَيَقُولُ اُ۬لسُّفَهَآءُ مِنَ اَ۬لنَّاسِ",
    'long':
        "سَيَقُولُ اُ۬لسُّفَهَآءُ مِنَ اَ۬لنَّاسِ مَا وَلّ۪يٰهُمْ عَن قِبْلَتِهِمُ اُ۬لتِے كَانُواْ عَلَيْهَاۖ قُل لِّلهِ اِ۬لْمَشْرِقُ وَالْمَغْرِبُۖ يَهْدِے مَنْ يَّشَآءُ اِ۪لَيٰ صِرَٰطٖ مُّسْتَقِيمٖۖ وَكَذَٰلِكَ جَعَلْنَٰكُمُۥٓ أُمَّةٗ وَسَطاٗ لِّتَكُونُواْ شُهَدَآءَ عَلَي اَ۬لنَّاسِ وَيَكُونَ اَ۬لرَّسُولُ عَلَيْكُمْ شَهِيداٗۖ",
    'surat': 'البقرة'
  },
  4: {
    'number': 4,
    'short': "وَاذْكُرُواْ اُ۬للَّهَ فِےٓ أَيَّامٖ مَّعْدُودَٰتٖۖ",
    'long':
        "وَاذْكُرُواْ اُ۬للَّهَ فِےٓ أَيَّامٖ مَّعْدُودَٰتٖۖ فَمَن تَعَجَّلَ فِے يَوْمَيْنِ فَلَآ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلَآ إِثْمَ عَلَيْهِ لِمَنِ اِ۪تَّق۪يٰۖ وَاتَّقُواْ اُ۬للَّهَ وَاعْلَمُوٓاْ أَنَّكُمُۥٓ إِلَيْهِ تُحْشَرُونَۖ وَمِنَ اَ۬لنَّاسِ مَنْ يُّعْجِبُكَ قَوْلُهُۥ فِے اِ۬لْحَيَوٰةِ اِ۬لدُّنْي۪ا وَيُشْهِدُ اُ۬للَّهَ عَلَيٰ مَا فِے قَلْبِهِۦ وَهُوَ أَلَدُّ اُ۬لْخِصَامِۖ",
    'surat': 'البقرة'
  },
  5: {
    'number': 5,
    'short': "تِلْكَ اَ۬لرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَيٰ بَعْضٖۖ",
    'long':
        "تِلْكَ اَ۬لرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَيٰ بَعْضٖۖ مِّنْهُم مَّن كَلَّمَ اَ۬للَّهُۖ وَرَفَعَ بَعْضَهُمْ دَرَجَٰتٖۖ وَءَاتَيْنَا عِيسَي اَ۪بْنَ مَرْيَمَ اَ۬لْبَيِّنَٰتِ وَأَيَّدْنَٰهُ بِرُوحِ اِ۬لْقُدُسِۖ وَلَوْ شَآءَ اَ۬للَّهُ مَا اَ۪قْتَتَلَ اَ۬لذِينَ مِنۢ بَعْدِهِم مِّنۢ بَعْدِ مَا جَآءَتْهُمُ اُ۬لْبَيِّنَٰتُ",
    'surat': 'البقرة'
  },
  6: {
    'number': 6,
    'short': "قُلَ اَوْ۟نَبِّئُكُم بِخَيْرٖ مِّن ذَٰلِكُمْۖ",
    'long':
        "قُلَ اَوْ۟نَبِّئُكُم بِخَيْرٖ مِّن ذَٰلِكُمْۖ لِلذِينَ اَ۪تَّقَوْاْ عِندَ رَبِّهِمْ جَنَّٰتٞ تَجْرِے مِن تَحْتِهَا اَ۬لَانْهَٰرُ خَٰلِدِينَ فِيهَا وَأَزْوَٰجٞ مُّطَهَّرَةٞ وَرِضْوَٰنٞ مِّنَ اَ۬للَّهِۖ وَاللَّهُ بَصِيرُۢ بِالْعِبَادِۖ اِ۬لذِينَ يَقُولُونَ رَبَّنَآ إِنَّنَآ ءَامَنَّا فَاغْفِرْ لَنَا ذُنُوبَنَا وَقِنَا عَذَابَ اَ۬لنّ۪ارِۖ",
    'surat': 'آل عمران'
  },
  7: {
    'number': 7,
    'short': "لَن تَنَالُواْ اُ۬لْبِرَّ حَتَّيٰ تُنفِقُواْ مِمَّا تُحِبُّونَۖ",
    'long':
        "لَن تَنَالُواْ اُ۬لْبِرَّ حَتَّيٰ تُنفِقُواْ مِمَّا تُحِبُّونَۖ وَمَا تُنفِقُواْ مِن شَےْءٖ فَإِنَّ اَ۬للَّهَ بِهِۦ عَلِيمٞۖ  كُلُّ اُ۬لطَّعَامِ كَانَ حِلّاٗ لِّبَنِےٓ إِسْرَآءِيلَ إِلَّا مَا حَرَّمَ إِسْرَآءِيلُ عَلَيٰ نَفْسِهِۦ مِن قَبْلِ أَن تُنَزَّلَ اَ۬لتَّوْر۪يٰةُۖ ",
    'surat': 'آل عمران'
  },
  8: {
    'number': 8,
    'short': "يَسْتَبْشِرُونَ بِنِعْمَةٖ مِّنَ اَ۬للَّهِ وَفَضْلٖ",
    'long':
        "يَسْتَبْشِرُونَ بِنِعْمَةٖ مِّنَ اَ۬للَّهِ وَفَضْلٖ وَأَنَّ اَ۬للَّهَ لَا يُضِيعُ أَجْرَ اَ۬لْمُومِنِينَ اَ۬لذِينَ اَ۪سْتَجَابُواْ لِلهِ وَالرَّسُولِ مِنۢ بَعْدِ مَآ أَصَابَهُمُ اُ۬لْقَرْحُۖ لِلذِينَ أَحْسَنُواْ مِنْهُمْ وَاتَّقَوَاْ اَجْرٌ عَظِيمٌۖ اِ۬لذِينَ قَالَ لَهُمُ اُ۬لنَّاسُ إِنَّ اَ۬لنَّاسَ قَدْ جَمَعُواْ لَكُمْ فَاخْشَوْهُمْ فَزَادَهُمُۥٓ إِيمَٰناٗۖ وَقَالُواْ حَسْبُنَا اَ۬للَّهُ وَنِعْمَ اَ۬لْوَكِيلُۖ",
    'surat': 'آل عمران'
  },
  9: {
    'number': 9,
    'short':
        "وَالْمُحْصَنَٰتُ مِنَ اَ۬لنِّسَآءِ الَّا مَا مَلَكَتَ اَيْمَٰنُكُمْۖ",
    'long':
        "وَالْمُحْصَنَٰتُ مِنَ اَ۬لنِّسَآءِ الَّا مَا مَلَكَتَ اَيْمَٰنُكُمْۖ كِتَٰبَ اَ۬للَّهِ عَلَيْكُمْۖ وَأَحَلَّ لَكُم مَّا وَرَآءَ ذَٰلِكُمُۥٓ أَن تَبْتَغُواْ بِأَمْوَٰلِكُم مُّحْصِنِينَ غَيْرَ مُسَٰفِحِينَۖ فَمَا اَ۪سْتَمْتَعْتُم بِهِۦ مِنْهُنَّ فَـَٔاتُوهُنَّ أُجُورَهُنَّ فَرِيضَةٗۖ وَلَا جُنَاحَ عَلَيْكُمْ فِيمَا تَرَٰضَيْتُم بِهِۦ مِنۢ بَعْدِ اِ۬لْفَرِيضَةِۖ إِنَّ اَ۬للَّهَ كَانَ عَلِيماً حَكِيماٗۖ",
    'surat': 'النساء'
  },
  10: {
    'number': 10,
    'short': "اِ۬للَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ",
    'long':
        "اِ۬للَّهُ لَآ إِلَٰهَ إِلَّا هُوَۖ لَيَجْمَعَنَّكُمُۥٓ إِلَيٰ يَوْمِ اِ۬لْقِيَٰمَةِ لَا رَيْبَ فِيهِۖ وَمَنَ اَصْدَقُ مِنَ اَ۬للَّهِ حَدِيثاٗۖ فَمَا لَكُمْ فِے اِ۬لْمُنَٰفِقِينَ فِئَتَيْنِ وَاللَّهُ أَرْكَسَهُم بِمَا كَسَبُوٓاْۖ أَتُرِيدُونَ أَن تَهْدُواْ مَنَ اَضَلَّ اَ۬للَّهُۖ وَمَنْ يُّضْلِلِ اِ۬للَّهُ فَلَن تَجِدَ لَهُۥ سَبِيلاٗۖ",
    'surat': 'النساء'
  },
  11: {
    'number': 11,
    'short':
        "لَّا يُحِبُّ اُ۬للَّهُ اُ۬لْجَهْرَ بِالسُّوٓءِ مِنَ اَ۬لْقَوْلِ إِلَّا مَن ظُلِمَۖ",
    'long':
        "لَّا يُحِبُّ اُ۬للَّهُ اُ۬لْجَهْرَ بِالسُّوٓءِ مِنَ اَ۬لْقَوْلِ إِلَّا مَن ظُلِمَۖ وَكَانَ اَ۬للَّهُ سَمِيعاً عَلِيماًۖ اِن تُبْدُواْ خَيْراً اَوْ تُخْفُوهُ أَوْ تَعْفُواْ عَن سُوٓءٖ فَإِنَّ اَ۬للَّهَ كَانَ عَفُوّاٗ قَدِيراًۖ",
    'surat': 'النساء'
  },
  12: {
    'number': 12,
    'short':
        "قَالَ رَجُلَٰنِ مِنَ اَ۬لذِينَ يَخَافُونَ أَنْعَمَ اَ۬للَّهُ عَلَيْهِمَا",
    'long':
        "قَالَ رَجُلَٰنِ مِنَ اَ۬لذِينَ يَخَافُونَ أَنْعَمَ اَ۬للَّهُ عَلَيْهِمَا اَ۟دْخُلُواْ عَلَيْهِمُ اُ۬لْبَابَۖ فَإِذَا دَخَلْتُمُوهُ فَإِنَّكُمْ غَٰلِبُونَۖ وَعَلَي اَ۬للَّهِ فَتَوَكَّلُوٓاْ إِن كُنتُم مُّومِنِينَۖ قَالُواْ يَٰمُوس۪يٰٓ إِنَّا لَن نَّدْخُلَهَآ أَبَداٗ مَّا دَامُواْ فِيهَا فَاذْهَبَ اَنتَ وَرَبُّكَ فَقَٰتِلَآ إِنَّا هَٰهُنَا قَٰعِدُونَۖ",
    'surat': 'المائدة'
  },
  13: {
    'number': 13,
    'short':
        "لَتَجِدَنَّ أَشَدَّ اَ۬لنَّاسِ عَدَٰوَةٗ لِّلذِينَ ءَامَنُواْ اُ۬لْيَهُودَ",
    'long':
        "لَتَجِدَنَّ أَشَدَّ اَ۬لنَّاسِ عَدَٰوَةٗ لِّلذِينَ ءَامَنُواْ اُ۬لْيَهُودَ وَالذِينَ أَشْرَكُواْۖ وَلَتَجِدَنَّ أَقْرَبَهُم مَّوَدَّةٗ لِّلذِينَ ءَامَنُواْ اُ۬لذِينَ قَالُوٓاْ إِنَّا نَصَٰر۪يٰۖ ذَٰلِكَ بِأَنَّ مِنْهُمْ قِسِّيسِينَ وَرُهْبَاناٗ وَأَنَّهُمْ لَا يَسْتَكْبِرُونَۖ ",
    'surat': 'المائدة'
  },
  14: {
    'number': 14,
    'short': "إِنَّمَا يَسْتَجِيبُ اُ۬لذِينَ يَسْمَعُونَۖ",
    'long':
        "إِنَّمَا يَسْتَجِيبُ اُ۬لذِينَ يَسْمَعُونَۖ وَالْمَوْت۪يٰ يَبْعَثُهُمُ اُ۬للَّهُ ثُمَّ إِلَيْهِ يُرْجَعُونَۖ وَقَالُواْ لَوْلَا نُزِّلَ عَلَيْهِ ءَايَةٞ مِّن رَّبِّهِۦۖ قُلِ اِنَّ اَ۬للَّهَ قَادِرٌ عَلَيٰٓ أَنْ يُّنَزِّلَ ءَايَةٗ وَلَٰكِنَّ أَكْثَرَهُمْ لَا يَعْلَمُونَۖ",
    'surat': 'الأنعام'
  },
  15: {
    'number': 15,
    'short': "وَلَوَ اَنَّنَا نَزَّلْنَآ إِلَيْهِمُ اُ۬لْمَلَٰٓئِكَةَ",
    'long':
        "وَلَوَ اَنَّنَا نَزَّلْنَآ إِلَيْهِمُ اُ۬لْمَلَٰٓئِكَةَ وَكَلَّمَهُمُ اُ۬لْمَوْت۪يٰ وَحَشَرْنَا عَلَيْهِمْ كُلَّ شَےْءٖ قِبَلاٗ مَّا كَانُواْ لِيُومِنُوٓاْ إِلَّآ أَنْ يَّشَآءَ اَ۬للَّهُ وَلَٰكِنَّ أَكْثَرَهُمْ يَجْهَلُونَۖ",
    'surat': 'الأنعام'
  },
  16: {
    'number': 16,
    'short': "فَمَا كَانَ دَعْو۪يٰهُمُۥٓ إِذْ جَآءَهُم بَأْسُنَآ",
    'long':
        "فَمَا كَانَ دَعْو۪يٰهُمُۥٓ إِذْ جَآءَهُم بَأْسُنَآ إِلَّآ أَن قَالُوٓاْ إِنَّا كُنَّا ظَٰلِمِينَۖ (4) فَلَنَسْـَٔلَنَّ اَ۬لذِينَ أُرْسِلَ إِلَيْهِمْ وَلَنَسْـَٔلَنَّ اَ۬لْمُرْسَلِينَۖ (5) فَلَنَقُصَّنَّ عَلَيْهِم بِعِلْمٖۖ وَمَا كُنَّا غَآئِبِينَۖ (6) وَالْوَزْنُ يَوْمَئِذٍ اِ۬لْحَقُّۖ فَمَن ثَقُلَتْ مَوَٰزِينُهُۥ فَأُوْلَٰٓئِكَ هُمُ اُ۬لْمُفْلِحُونَۖ",
    'surat': 'الأعراف'
  },
  17: {
    'number': 17,
    'short': "قَالَ اَ۬لْمَلَأُ اُ۬لذِينَ اَ۪سْتَكْبَرُواْ",
    'long':
        "قَالَ اَ۬لْمَلَأُ اُ۬لذِينَ اَ۪سْتَكْبَرُواْ مِن قَوْمِهِۦ لَنُخْرِجَنَّكَ يَٰشُعَيْبُ وَالذِينَ ءَامَنُواْ مَعَكَ مِن قَرْيَتِنَآ أَوْ لَتَعُودُنَّ فِے مِلَّتِنَاۖ قَالَ أَوَلَوْ كُنَّا كَٰرِهِينَۖ قَدِ اِ۪فْتَرَيْنَا عَلَي اَ۬للَّهِ كَذِباً اِنْ عُدْنَا فِے مِلَّتِكُم بَعْدَ إِذْ نَجّ۪يٰنَا اَ۬للَّهُ مِنْهَاۖ وَمَا يَكُونُ لَنَآ أَن نَّعُودَ فِيهَآ إِلَّآ أَنْ يَّشَآءَ اَ۬للَّهُ رَبُّنَاۖ وَسِعَ رَبُّنَا كُلَّ شَےْءٍ عِلْماًۖ عَلَي اَ۬للَّهِ تَوَكَّلْنَاۖ",
    'surat': 'الأعراف'
  },
  18: {
    'number': 18,
    'short': "وَإِذْ نَتَقْنَا اَ۬لْجَبَلَ فَوْقَهُمْ",
    'long':
        "وَإِذْ نَتَقْنَا اَ۬لْجَبَلَ فَوْقَهُمْ كَأَنَّهُۥ ظُلَّةٞ وَظَنُّوٓاْ أَنَّهُۥ وَاقِعُۢ بِهِمْ خُذُواْ مَآ ءَاتَيْنَٰكُم بِقُوَّةٖ وَاذْكُرُواْ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَۖ وَإِذَ اَخَذَ رَبُّكَ مِنۢ بَنِےٓ ءَادَمَ مِن ظُهُورِهِمْ ذُرِّيَّٰتِهِمْ وَأَشْهَدَهُمْ عَلَيٰٓ أَنفُسِهِمُۥٓ أَلَسْتُ بِرَبِّكُمْ قَالُواْ بَل۪يٰۖ شَهِدْنَآ",
    'surat': 'الأعراف'
  },
  19: {
    'number': 19,
    'short': "وَاعْلَمُوٓاْ أَنَّمَا غَنِمْتُم",
    'long':
        "وَاعْلَمُوٓاْ أَنَّمَا غَنِمْتُم مِّن شَےْءٖ فَأَنَّ لِلهِ خُمُسَهُۥ وَلِلرَّسُولِ وَلِذِے اِ۬لْقُرْب۪يٰ وَالْيَتَٰم۪يٰ وَالْمَسَٰكِينِ وَابْنِ اِ۬لسَّبِيلِ إِن كُنتُمُۥٓ ءَامَنتُم بِاللَّهِ وَمَآ أَنزَلْنَا عَلَيٰ عَبْدِنَا يَوْمَ اَ۬لْفُرْقَانِ يَوْمَ اَ۪لْتَقَي اَ۬لْجَمْعَٰنِۖ وَاللَّهُ عَلَيٰ كُلِّ شَےْءٖ قَدِيرٌۖ ",
    'surat': 'الأنفال'
  },
  20: {
    'number': 20,
    'short':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُوٓاْ إِنَّ كَثِيراٗ مِّنَ اَ۬لَاحْب۪ارِ",
    'long':
        "يَٰٓأَيُّهَا اَ۬لذِينَ ءَامَنُوٓاْ إِنَّ كَثِيراٗ مِّنَ اَ۬لَاحْب۪ارِ وَالرُّهْبَانِ لَيَاكُلُونَ أَمْوَٰلَ اَ۬لنَّاسِ بِالْبَٰطِلِ وَيَصُدُّونَ عَن سَبِيلِ اِ۬للَّهِۖ وَالذِينَ يَكْنِزُونَ اَ۬لذَّهَبَ وَالْفِضَّةَ وَلَا يُنفِقُونَهَا فِے سَبِيلِ اِ۬للَّهِ فَبَشِّرْهُم بِعَذَابٍ اَلِيمٖۖ يَوْمَ يُحْم۪يٰ عَلَيْهَا فِے ن۪ارِ جَهَنَّمَ فَتُكْو۪يٰ بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ هَٰذَا مَا كَنَزْتُمْ لِأَنفُسِكُمْ فَذُوقُواْ مَا كُنتُمْ تَكْنِزُونَۖ",
    'surat': 'التوبة'
  },
  21: {
    'number': 21,
    'short':
        "إِنَّمَا اَ۬لسَّبِيلُ عَلَي اَ۬لذِينَ يَسْتَٰذِنُونَكَ وَهُمُۥٓ أَغْنِيَآءُۖ ",
    'long':
        "إِنَّمَا اَ۬لسَّبِيلُ عَلَي اَ۬لذِينَ يَسْتَٰذِنُونَكَ وَهُمُۥٓ أَغْنِيَآءُۖ رَضُواْ بِأَنْ يَّكُونُواْ مَعَ اَ۬لْخَوَالِفِۖ وَطَبَعَ اَ۬للَّهُ عَلَيٰ قُلُوبِهِمْ فَهُمْ لَا يَعْلَمُونَۖ يَعْتَذِرُونَ إِلَيْكُمُۥٓ إِذَا رَجَعْتُمُۥٓ إِلَيْهِمْۖ قُل لَّا تَعْتَذِرُواْ لَن نُّومِنَ لَكُمْۖ قَدْ نَبَّأَنَا اَ۬للَّهُ مِنَ اَخْب۪ارِكُمْۖ",
    'surat': 'التوبة'
  },
  22: {
    'number': 22,
    'short': "لِّلذِينَ أَحْسَنُواْ اُ۬لْحُسْن۪يٰ وَزِيَادَةٞۖ",
    'long':
        "لِّلذِينَ أَحْسَنُواْ اُ۬لْحُسْن۪يٰ وَزِيَادَةٞۖ وَلَا يَرْهَقُ وُجُوهَهُمْ قَتَرٞ وَلَا ذِلَّةٌۖ ا۟وْلَٰٓئِكَ أَصْحَٰبُ اُ۬لْجَنَّةِۖ هُمْ فِيهَا خَٰلِدُونَۖ وَالذِينَ كَسَبُواْ اُ۬لسَّيِّـَٔاتِ جَزَآءُ سَيِّئَةِۢ بِمِثْلِهَا وَتَرْهَقُهُمْ ذِلَّةٞ مَّا لَهُم مِّنَ اَ۬للَّهِ مِنْ عَاصِمٖ كَأَنَّمَآ أُغْشِيَتْ وُجُوهُهُمْ قِطَعاٗ مِّنَ اَ۬ليْلِ مُظْلِماًۖ",
    'surat': 'يونس'
  },
  23: {
    'number': 23,
    'short':
        "وَمَا مِن دَآبَّةٖ فِے اِ۬لَارْضِ إِلَّا عَلَي اَ۬للَّهِ رِزْقُهَا",
    'long':
        "وَمَا مِن دَآبَّةٖ فِے اِ۬لَارْضِ إِلَّا عَلَي اَ۬للَّهِ رِزْقُهَا وَيَعْلَمُ مُسْتَقَرَّهَا وَمُسْتَوْدَعَهَاۖ كُلّٞ فِے كِتَٰبٖ مُّبِينٖۖ وَهُوَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ فِے سِتَّةِ أَيَّامٖ وَكَانَ عَرْشُهُۥ عَلَي اَ۬لْمَآءِ لِيَبْلُوَكُمُۥٓ أَيُّكُمُۥٓ أَحْسَنُ عَمَلاٗۖ",
    'surat': 'هود'
  },
  24: {
    'number': 24,
    'short': "وَإِلَيٰ مَدْيَنَ أَخَاهُمْ شُعَيْباٗۖ",
    'long':
        "وَإِلَيٰ مَدْيَنَ أَخَاهُمْ شُعَيْباٗۖ قَالَ يَٰقَوْمِ اِ۟عْبُدُواْ اُ۬للَّهَ مَا لَكُم مِّنِ اِلَٰهٍ غَيْرُهُۥۖ وَلَا تَنقُصُواْ اُ۬لْمِكْيَالَ وَالْمِيزَانَۖ إِنِّيَ أَر۪يٰكُم بِخَيْرٖ وَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٖ مُّحِيطٖۖ وَيَٰقَوْمِ أَوْفُواْ اُ۬لْمِكْيَالَ وَالْمِيزَانَ بِالْقِسْطِۖ وَلَا تَبْخَسُواْ اُ۬لنَّاسَ أَشْيَآءَهُمْ وَلَا تَعْثَوْاْ فِے اِ۬لَارْضِ مُفْسِدِينَۖ",
    'surat': 'هود'
  },
  25: {
    'number': 25,
    'short': "وَمَآ أُبَرِّۓُ نَفْسِيَۖ",
    'long':
        "وَمَآ أُبَرِّۓُ نَفْسِيَۖ إِنَّ اَ۬لنَّفْسَ لَأَمَّارَةُۢ بِالسُّوٓءِ الَّا مَا رَحِمَ رَبِّيَۖ إِنَّ رَبِّے غَفُورٞ رَّحِيمٞۖ وَقَالَ اَ۬لْمَلِكُ اُ۪يتُونِے بِهِۦٓ أَسْتَخْلِصْهُ لِنَفْسِےۖ فَلَمَّا كَلَّمَهُۥ قَالَ إِنَّكَ اَ۬لْيَوْمَ لَدَيْنَا مَكِينٌ اَمِينٞۖ",
    'surat': 'يوسف'
  },
  26: {
    'number': 26,
    'short':
        "أَفَمَنْ يَّعْلَمُ أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ اَ۬لْحَقُّ",
    'long':
        "أَفَمَنْ يَّعْلَمُ أَنَّمَآ أُنزِلَ إِلَيْكَ مِن رَّبِّكَ اَ۬لْحَقُّ كَمَنْ هُوَ أَعْم۪يٰٓۖ إِنَّمَا يَتَذَكَّرُ أُوْلُواْ اُ۬لَالْبَٰبِ (21) اِ۬لذِينَ يُوفُونَ بِعَهْدِ اِ۬للَّهِ وَلَا يَنقُضُونَ اَ۬لْمِيثَٰقَ (22) وَالذِينَ يَصِلُونَ مَآ أَمَرَ اَ۬للَّهُ بِهِۦٓ أَنْ يُّوصَلَ وَيَخْشَوْنَ رَبَّهُمْ وَيَخَافُونَ سُوٓءَ اَ۬لْحِسَابِ ",
    'surat': 'الرعد'
  },
  27: {
    'number': 27,
    'short': "أَلَٓر۪ۖ تِلْكَ ءَايَٰتُ اُ۬لْكِتَٰبِ وَقُرْءَانٖ مُّبِينٖۖ",
    'long':
        "أَلَٓر۪ۖ تِلْكَ ءَايَٰتُ اُ۬لْكِتَٰبِ وَقُرْءَانٖ مُّبِينٖۖ رُّبَمَا يَوَدُّ اُ۬لذِينَ كَفَرُواْ لَوْ كَانُواْ مُسْلِمِينَۖ ذَرْهُمْ يَاكُلُواْ وَيَتَمَتَّعُواْ وَيُلْهِهِمُ اُ۬لَامَلُ فَسَوْفَ يَعْلَمُونَۖ وَمَآ أَهْلَكْنَا مِن قَرْيَةٍ اِلَّا وَلَهَا كِتَابٞ مَّعْلُومٞۖ مَّا تَسْبِقُ مِنُ ا۟مَّةٍ اَجَلَهَا وَمَا يَسْتَٰخِرُونَۖ",
    'surat': 'الحجر'
  },
  28: {
    'number': 28,
    'short': "وَقَالَ اَ۬للَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيْنِ اِ۪ثْنَيْنِۖ",
    'long':
        "وَقَالَ اَ۬للَّهُ لَا تَتَّخِذُوٓاْ إِلَٰهَيْنِ اِ۪ثْنَيْنِۖ إِنَّمَا هُوَ إِلَٰهٞ وَٰحِدٞۖ فَإِيَّٰيَ فَارْهَبُونِۖ وَلَهُۥ مَا فِے اِ۬لسَّمَٰوَٰتِ وَالَارْضِ وَلَهُ اُ۬لدِّينُ وَاصِباًۖ اَفَغَيْرَ اَ۬للَّهِ تَتَّقُونَۖ وَمَا بِكُم مِّن نِّعْمَةٖ فَمِنَ اَ۬للَّهِۖ ثُمَّ إِذَا مَسَّكُمُ اُ۬لضُّرُّ فَإِلَيْهِ تَجْـَٔرُونَۖ ثُمَّ إِذَا كَشَفَ اَ۬لضُّرَّ عَنكُمُۥٓ إِذَا فَرِيقٞ مِّنكُم بِرَبِّهِمْ يُشْرِكُونَ لِيَكْفُرُواْ بِمَآ ءَاتَيْنَٰهُمْۖ فَتَمَتَّعُواْۖ فَسَوْفَ تَعْلَمُونَۖ",
    'surat': 'النحل'
  },
  29: {
    'number': 29,
    'short': "سُبْحَٰنَ اَ۬لذِےٓ أَسْر۪يٰ بِعَبْدِهِۦ لَيْلاٗ",
    'long':
        "سُبْحَٰنَ اَ۬لذِےٓ أَسْر۪يٰ بِعَبْدِهِۦ لَيْلاٗ مِّنَ اَ۬لْمَسْجِدِ اِ۬لْحَرَامِ إِلَي اَ۬لْمَسْجِدِ اِ۬لَاقْصَا اَ۬لذِے بَٰرَكْنَا حَوْلَهُۥ لِنُرِيَهُۥ مِنَ اٰيَٰتِنَآۖ إِنَّهُۥ هُوَ اَ۬لسَّمِيعُ اُ۬لْبَصِيرُۖ وَءَاتَيْنَا مُوسَي اَ۬لْكِتَٰبَ وَجَعَلْنَٰهُ هُديٗ لِّبَنِےٓ إِسْرَآءِيلَ أَلَّا تَتَّخِذُواْ مِن دُونِے وَكِيلاٗ ذُرِّيَّةَ مَنْ حَمَلْنَا مَعَ نُوحٍۖ اِنَّهُۥ كَانَ عَبْداٗ شَكُوراٗۖ ",
    'surat': 'الإسراء'
  },
  30: {
    'number': 30,
    'short':
        "اَوَلَمْ يَرَوَاْ اَنَّ اَ۬للَّهَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ",
    'long':
        "اَوَلَمْ يَرَوَاْ اَنَّ اَ۬للَّهَ اَ۬لذِے خَلَقَ اَ۬لسَّمَٰوَٰتِ وَالَارْضَ قَادِرٌ عَلَيٰٓ أَنْ يَّخْلُقَ مِثْلَهُمْ وَجَعَلَ لَهُمُۥٓ أَجَلاٗ لَّا رَيْبَ فِيهِ فَأَبَي اَ۬لظَّٰلِمُونَ إِلَّا كُفُوراٗۖ (99) قُل لَّوَ اَنتُمْ تَمْلِكُونَ خَزَآئِنَ رَحْمَةِ رَبِّيَ إِذاٗ لَّأَمْسَكْتُمْ خَشْيَةَ اَ۬لِانفَاقِۖ وَكَانَ اَ۬لِانسَٰنُ قَتُوراٗۖ",
    'surat': 'الإسراء'
  },
  31: {
    'number': 31,
    'short': "قَالَ أَلَمَ اَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِے صَبْراٗۖ",
    'long':
        "قَالَ أَلَمَ اَقُل لَّكَ إِنَّكَ لَن تَسْتَطِيعَ مَعِے صَبْراٗۖ قَالَ إِن سَأَلْتُكَ عَن شَےْءِۢ بَعْدَهَا فَلَا تُصَٰحِبْنِے قَدْ بَلَغْتَ مِن لَّدُنِے عُذْراٗۖ فَانطَلَقَا حَتَّيٰٓ إِذَآ أَتَيَآ أَهْلَ قَرْيَةٍ اِ۪سْتَطْعَمَآ أَهْلَهَا فَأَبَوَاْ اَنْ يُّضَيِّفُوهُمَا فَوَجَدَا فِيهَا جِدَاراٗ يُرِيدُ أَنْ يَّنقَضَّ فَأَقَامَهُۥۖ قَالَ لَوْ شِئْتَ لَتَّخَذتَّ عَلَيْهِ أَجْراٗۖ قَالَ هَٰذَا فِرَاقُ بَيْنِے وَبَيْنِكَۖ",
    'surat': 'الكهف'
  },
  32: {
    'number': 32,
    'short': "طَه۪ۖ مَآ أَنزَلْنَا عَلَيْكَ اَ۬لْقُرْءَانَ لِتَشْق۪يٰٓ",
    'long':
        "طَه۪ۖ مَآ أَنزَلْنَا عَلَيْكَ اَ۬لْقُرْءَانَ لِتَشْق۪يٰٓ إِلَّا تَذْكِرَةٗ لِّمَنْ يَّخْش۪يٰۖ تَنزِيلاٗ مِّمَّنْ خَلَقَ اَ۬لَارْضَ وَالسَّمَٰوَٰتِ اِ۬لْعُلَيۖ اَ۬لرَّحْمَٰنُ عَلَي اَ۬لْعَرْشِ اِ۪سْتَو۪يٰۖ لَهُۥ مَا فِے اِ۬لسَّمَٰوَٰتِ وَمَا فِے اِ۬لَارْضِ وَمَا بَيْنَهُمَا وَمَا تَحْتَ اَ۬لثَّر۪يٰۖ",
    'surat': 'طه'
  },
  33: {
    'number': 33,
    'short':
        "اَ۪قْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِے غَفْلَةٖ مُّعْرِضُونَۖ",
    'long':
        "اَ۪قْتَرَبَ لِلنَّاسِ حِسَابُهُمْ وَهُمْ فِے غَفْلَةٖ مُّعْرِضُونَۖ مَا يَاتِيهِم مِّن ذِكْرٖ مِّن رَّبِّهِم مُّحْدَثٍ اِلَّا اَ۪سْتَمَعُوهُ وَهُمْ يَلْعَبُونَ لَٰهِيَةٗ قُلُوبُهُمْۖ وَأَسَرُّواْ اُ۬لنَّجْوَي اَ۬لذِينَ ظَلَمُواْ هَلْ هَٰذَآ إِلَّا بَشَرٞ مِّثْلُكُمُۥٓۖ أَفَتَاتُونَ اَ۬لسِّحْرَ وَأَنتُمْ تُبْصِرُونَۖ قُل رَّبِّے يَعْلَمُ اُ۬لْقَوْلَ فِے اِ۬لسَّمَآءِ وَالَارْضِۖ وَهُوَ اَ۬لسَّمِيعُ اُ۬لْعَلِيمُۖ",
    'surat': 'الأنبياء'
  },
  34: {
    'number': 34,
    'short': "يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم",
    'long': "يا أيها الناس اتقوا ربكم إن زلزلة الساعة شيء عظيم",
    'surat': 'الحج'
  },
  35: {
    'number': 35,
    'short': "قد افلح المومنون الذين هم في صلاتهم خاشعون",
    'long': "قد افلح المومنون الذين هم في صلاتهم خاشعون",
    'surat': 'المومنون'
  },
  36: {
    'number': 36,
    'short': "يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان",
    'long': "يا أيها الذين آمنوا لا تتبعوا خطوات الشيطان",
    'surat': 'النور'
  },
  37: {
    'number': 37,
    'short': "وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة",
    'long': "وقال الذين لا يرجون لقاءنا لولا أنزل علينا الملائكة",
    'surat': 'الفرقان'
  },
  38: {
    'number': 38,
    'short': "قالوا أنومن لك واتبعك الأرذلون",
    'long': "قالوا أنومن لك واتبعك الأرذلون",
    'surat': 'الشعراء'
  },
  39: {
    'number': 39,
    'short': "فما كان جواب قومه إلا أن قالوا أخرجوا آل لوط",
    'long': "فما كان جواب قومه إلا أن قالوا أخرجوا آل لوط",
    'surat': 'النمل'
  },
  40: {
    'number': 40,
    'short': "ولقد وصلنا لهم القول لعلهم يتذكرون",
    'long': "ولقد وصلنا لهم القول لعلهم يتذكرون",
    'surat': 'القصص'
  },
  41: {
    'number': 41,
    'short': "ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن",
    'long': "ولا تجادلوا أهل الكتاب إلا بالتي هي أحسن",
    'surat': 'العنكبوت'
  },
  42: {
    'number': 42,
    'short': "ومن يسلم وجهه إلى اللّه وهو محسن",
    'long': "ومن يسلم وجهه إلى اللّه وهو محسن",
    'surat': 'لقمان'
  },
  43: {
    'number': 43,
    'short': "ومن يقنت منكن للّه ورسوله وتعمل صالحا",
    'long': "ومن يقنت منكن للّه ورسوله وتعمل صالحا",
    'surat': 'الأحزاب'
  },
  44: {
    'number': 44,
    'short': "قل من يرزقكم من السماوات والأرض قل اللّه",
    'long': "قل من يرزقكم من السماوات والأرض قل اللّه",
    'surat': 'سبأ'
  },
  45: {
    'number': 45,
    'short': "وما أنزلنا على قومه من بعده من جند من السماء",
    'long': "وما أنزلنا على قومه من بعده من جند من السماء",
    'surat': 'يس'
  },
  46: {
    'number': 46,
    'short': "فنبذناه بالعراء وهو سقيم",
    'long': "فنبذناه بالعراء وهو سقيم",
    'surat': 'الصافات'
  },
  47: {
    'number': 47,
    'short': "فمن أظلم ممن كذب على اللّه وكذب",
    'long': "فمن أظلم ممن كذب على اللّه وكذب",
    'surat': 'الزمر'
  },
  48: {
    'number': 48,
    'short': "ويا قوم مالي أدعوكم إلى النجاة وتدعونني إلى النار",
    'long': "ويا قوم مالي أدعوكم إلى النجاة وتدعونني إلى النار",
    'surat': 'غافر'
  },
  49: {
    'number': 49,
    'short': "إليه يرد علم الساعة وما تخرج من ثمرات من أكمامها",
    'long': "إليه يرد علم الساعة وما تخرج من ثمرات من أكمامها",
    'surat': 'فصلت'
  },
  50: {
    'number': 50,
    'short': "قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم",
    'long': "قال أولو جئتكم بأهدى مما وجدتم عليه آباءكم",
    'surat': 'الزخرف'
  },
  51: {
    'number': 51,
    'short': "حم تنزيل الكتاب من اللّه العزيز الحكيم",
    'long': "حم تنزيل الكتاب من اللّه العزيز الحكيم",
    'surat': 'الأحقاف'
  },
  52: {
    'number': 52,
    'short': "لقد رضي اللّه عن المومنين إذ يبايعونك تحت الشجرة",
    'long': "لقد رضي اللّه عن المومنين إذ يبايعونك تحت الشجرة",
    'surat': 'الفتح'
  },
  53: {
    'number': 53,
    'short': "قال فما خطبكم أيها المرسلون",
    'long': "قال فما خطبكم أيها المرسلون",
    'surat': 'الذاريات'
  },
  54: {
    'number': 54,
    'short': "الرحمان علم القرآن خلق الإنسان علمه البيان",
    'long': "الرحمان علم القرآن خلق الإنسان علمه البيان",
    'surat': 'الرحمان'
  },
  55: {
    'number': 55,
    'short': "قد سمع اللّه قول التي تجادلك في زوجها وتشتكي إلى اللّه",
    'long': "قد سمع اللّه قول التي تجادلك في زوجها وتشتكي إلى اللّه",
    'surat': 'المجادلة'
  },
  56: {
    'number': 56,
    'short': "يسبح للّه ما في السماوات وما في الأرض",
    'long': "يسبح للّه ما في السماوات وما في الأرض",
    'surat': 'الجمعة'
  },
  57: {
    'number': 57,
    'short': "تبارك الذي بيده الملك وهو على كل شيء قدير",
    'long': "تبارك الذي بيده الملك وهو على كل شيء قدير",
    'surat': 'الملك'
  },
  58: {
    'number': 58,
    'short': "قل أوحي إلي أنه استمع نفر من الجن",
    'long': "قل أوحي إلي أنه استمع نفر من الجن",
    'surat': 'الجن'
  },
  59: {
    'number': 59,
    'short': "عم يتساءلون عن النبإ العظيم الذي هم فيه مختلفون",
    'long': "عم يتساءلون عن النبإ العظيم الذي هم فيه مختلفون",
    'surat': 'النبأ'
  },
  60: {
    'number': 60,
    'short': "سبح اسم ربك الأعلى الذي خلق فسوى والذي قدر فهدى",
    'long': "سبح اسم ربك الأعلى الذي خلق فسوى والذي قدر فهدى",
    'surat': 'الأعلى'
  }
};

Map getAlAhzabMap() {
  return hizbsMap;
}
