// import 'package:flutter/material.dart';

const List alAhzab = [
  ["1", "الحمد لله رب العالمين"],
  ["2", "وإذا لقوا الذين آمنوا قالوا آمنا"],
  ["3", "سيقول السفهاء من الناس"],
  ["4", "واذكروا الله في أيام معدودات"],
  ["5", "تلك الرسل فضلنا بعضهم على بعض"],
  ["6", "قل أؤنبكم بخير من ذلكم"],
  ["7", "لن تنالوا البر حتى تنفقوا مما تحبون"],
  ["8", "يستبشرون بنعمة من الله وفضل"],
  ["9", "والمحصنات من النساء"],
  ["10", "الله لا إله إلا هو ليجمعنكم"],
  ["11", "لا يحب الله الجهر بالسوء من القول"],
  ["12", "قال رجلان من الذين يخافون أنعم الل عليهما"],
  ["13", "لتجدن أشد الناس عداوة للذين آمنوا اليهود"],
];

List getAlAhzabList() {
  return alAhzab;
}
